
<!DOCTYPE HTML>
<html lang="es" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1. Comenzando el camino · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-accordion/accordion.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-styled-blockquotes/plugin-styled-blockquotes.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-githubcontributors/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-language-picker/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02-variables.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Escribe para buscar" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introducción
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="01-intro.html">
            
                <a href="01-intro.html">
            
                    
                    1. Comenzando el camino
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02-variables.html">
            
                <a href="02-variables.html">
            
                    
                    2. Variables
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="03-conditional.html">
            
                <a href="03-conditional.html">
            
                    
                    3. Condicionales
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="04-functions.html">
            
                <a href="04-functions.html">
            
                    
                    4. Funciones
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="05-iterations.html">
            
                <a href="05-iterations.html">
            
                    
                    5. Bucles
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="06-strings.html">
            
                <a href="06-strings.html">
            
                    
                    6. Cadenas
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="07-files.html">
            
                <a href="07-files.html">
            
                    
                    7. Archivos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="08-lists.html">
            
                <a href="08-lists.html">
            
                    
                    8. Listas
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="09-dictionaries.html">
            
                <a href="09-dictionaries.html">
            
                    
                    9. Diccionarios
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.10" data-path="10-tuples.html">
            
                <a href="10-tuples.html">
            
                    
                    10. Tuplas
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.11" data-path="11-regex.html">
            
                <a href="11-regex.html">
            
                    
                    11. Regex
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.12" data-path="12-network.html">
            
                <a href="12-network.html">
            
                    
                    12. Programas en red
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.13" data-path="13-web.html">
            
                <a href="13-web.html">
            
                    
                    13. Python y servicios web
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.14" data-path="14-objects.html">
            
                <a href="14-objects.html">
            
                    
                    14. Objetos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.15" data-path="15-database.html">
            
                <a href="15-database.html">
            
                    
                    15. Python y Bases de Datos
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="crditos.html">
            
                <a href="crditos.html">
            
                    
                    Créditos
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Publicado con GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >1. Comenzando el camino</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="sobre-este-viaje">Sobre este viaje</h1>
<ul>
<li><a href="#por-que-programar">&#xBF;Por qu&#xE9; deber&#xED;a aprender a escribir programas?</a></li>
<li><a href="#creatividad-y-motivacion">Creatividad y motivaci&#xF3;n</a></li>
<li><a href="#arquitectura-de-hardware-de-ordenador">Arquitectura del hardware del ordenador</a></li>
<li><a href="#comprension-programacion">Entendiendo la programaci&#xF3;n</a></li>
<li><a href="#palabras-y-oraciones">Palabras y oraciones</a></li>
<li><a href="#conversing-with-python">Conversando con Python</a></li>
<li><a href="#terminolog&#xED;a-interprete-y-compilador">Terminolog&#xED;a: int&#xE9;rprete y compilador</a></li>
<li><a href="#writing-a-program">Escribiendo un programa</a></li>
<li><a href="#what-is-a-program">&#xBF;Qu&#xE9; es un programa?</a></li>
<li><a href="#the-building-blocks-of-programs">Los componentes b&#xE1;sicos de los programas?</a></li>
<li><a href="#what-could-possibly-go-wrong">&#xBF;Qu&#xE9; podr&#xED;a salir mal?</a></li>
<li><a href="#the-learning-journey">El viaje del aprendizaje</a></li>
<li><a href="#ejercicios">Ejercicios</a></li>
</ul>
<div class="alert alert-info hints-alert"><div class="hints-icon"><i class="fa fa fa-info-circle"></i></div><div class="hints-container">
<p></p>
<h3 id="instalando-python">Instalando Python</h3>
<p>Para instalar Python en nuestro ordenador, s&#xF3;lo tendremos que ir a la web <a href="https://www.python.org/" target="_blank">https://www.python.org/</a> y descargar el instalador.</p>
<p>Los pasos var&#xED;an algo entre sistemas operativos.</p>
<p>&#xA1;Atenci&#xF3;n! En Windows, no olvides a&#xF1;adir Python al PATH en los primeros pasos de instalaci&#xF3;n:</p>
<figure id="fig2.1.1"><img src="https://deleyva.gitbooks.io/automatiza-tu-aprendizaje-con-python/content/img/python-path.png" alt="Instalando Python"><figcaption>Imagen - Instalando Python</figcaption></figure>
<p>Una vez hecho eso ya tendremos accesible Python desde la terminal.</p>
<p></p><div style="position: relative;padding-bottom: 56.25%;padding-top: 25px;height: 0;"><iframe frameborder="0" allowfullscreen style="border: none;position: absolute;top: 0;left: 0;width: 100%;height: 100%;" src="//www.youtube.com/embed/9fNKy9zOPkg"></iframe></div><p></p>
</div></div>
<h2 id="por-que-programar">&#xBF;Por qu&#xE9; deber&#xED;a aprender a escribir programas? </h2>
<p>Escribir programas (o programar) es una actividad muy creativa y gratificante. Puedes escribir programas por muchas razones, desde ganarte la vida, resolver un problema dif&#xED;cil de an&#xE1;lisis de datos, hasta divertirte o ayudar a alguien m&#xE1;s a resolver un problema. Este libro asume que <strong>todos</strong> debemos saber c&#xF3;mo programar, y que una vez que sepa c&#xF3;mo programar, descubrir&#xE1;s qu&#xE9; quieres hacer con tus nuevas habilidades.</p>
<p>Estamos rodeados en nuestra vida diaria de ordenadores que van desde port&#xE1;tiles hasta tel&#xE9;fonos m&#xF3;viles. Podemos pensar en estos ordenadores como nuestros &quot;asistentes personales&quot; que pueden hacerse cargo de muchas cosas en nuestro nombre. El hardware en nuestros ordenadores de hoy en d&#xED;a est&#xE1; esencialmente construido para hacernos continuamente la pregunta &quot;&#xBF;Qu&#xE9; quieres que haga ahora?&quot;</p>
<figure id="fig2.1.2"><img src="../img/descarga.svg" alt="Asistente personal digital"><figcaption>Imagen - Asistente personal digital</figcaption></figure>
<p>Los programadores agregan un sistema operativo y un conjunto de aplicaciones al hardware y terminamos con un Asistente digital personal que es bastante &#xFA;til y capaz de ayudarnos a hacer muchas cosas diferentes.</p>
<p>Nuestros ordenadores son r&#xE1;pidos y tienen una gran cantidad de memoria y podr&#xED;an ser muy &#xFA;tiles para nosotros si supi&#xE9;ramos el idioma con el que decirle al ordenador lo que nos gustar&#xED;a &quot;hacer a continuaci&#xF3;n&quot;. Si conoci&#xE9;ramos este idioma, podr&#xED;amos decirle al ordenador que realice tareas en nuestro nombre que son repetitivas. Curiosamente, las cosas que los ordenadores pueden hacer mejor son a menudo el tipo de cosas que a los humanos nos parecen aburridas.</p>
<p>Por ejemplo, mira los primeros tres p&#xE1;rrafos de este cap&#xED;tulo, dime la palabra que se usa con m&#xE1;s frecuencia y cu&#xE1;ntas veces se usa dicha palabra. Si bien pudiste leer y entender las palabras en unos pocos segundos, contarlas es casi doloroso porque no es el tipo de problema que las mentes humanas est&#xE1;n dise&#xF1;adas para resolver. Para una ordenador es todo lo contrario, leer y entender texto de una hoja de papel es dif&#xED;cil, pero contar las palabras y decirle cu&#xE1;ntas veces se us&#xF3; la palabra m&#xE1;s usada es muy f&#xE1;cil:</p>
<pre><code class="lang-bash">python words.py
    Enter file:words.txt
    to 16
</code></pre>
<p>Nuestro &quot;asistente de an&#xE1;lisis de informaci&#xF3;n personal&quot; r&#xE1;pidamente nos dijo que la palabra &quot;to&quot; se us&#xF3; diecis&#xE9;is veces en los primeros tres p&#xE1;rrafos de este cap&#xED;tulo (v&#xE1;lido para la versi&#xF3;n inglesa de este libro).</p>
<p>Para usar ese poder de la m&#xE1;quina, necesitamos adquirir la habilidad para hablar el &quot;lenguaje del ordenador&quot;. Una vez que aprendas este nuevo idioma, puedes delegar tareas mundanas a su compa&#xF1;ero (el ordenador), lo que te deja m&#xE1;s tiempo para hacer las cosas para las que est&#xE1;s preparado de manera &#xFA;nica. Traes creatividad, intuici&#xF3;n e inventiva a esta asociaci&#xF3;n.</p>
<h2 id="creatividad-y-motivacion">Creatividad y motivaci&#xF3;n </h2>
<p>Si bien este libro no est&#xE1; dirigido a programadores profesionales, la programaci&#xF3;n profesional puede ser un trabajo muy gratificante tanto a nivel financiero como personal. Crear programas &#xFA;tiles, elegantes e inteligentes para que otros puedan usar es una actividad muy creativa. Su ordenador usualmente contiene muchos programas diferentes, de diferentes grupos de programadores, cada uno compitiendo por su atenci&#xF3;n e inter&#xE9;s. Hacen todo lo posible para satisfacer sus necesidades y le brindan una excelente experiencia de usuario en el proceso. En algunas situaciones, cuando elige una pieza de software, los programadores reciben una compensaci&#xF3;n directa debido a su elecci&#xF3;n.</p>
<p>Si pensamos en los programas como la producci&#xF3;n creativa de grupos de programadores, tal vez la siguiente figura sea una versi&#xF3;n posible de nuestra PDA:</p>
<figure id="fig2.1.3"><img src="../img/programers-talking-to-you.svg" alt="Programadores hablando contigo"><figcaption>Imagen - Programadores hablando contigo</figcaption></figure>
<p>Por ahora, nuestra principal motivaci&#xF3;n no es ganar dinero o complacer a los usuarios finales, sino que seamos m&#xE1;s productivos en el manejo de los datos y la informaci&#xF3;n que encontraremos en nuestras vidas. Cuando comiences, ser&#xE1;s el programador y el usuario final de tus programas. A medida que adquieras destreza como programador, tus pensamientos pueden dirigirse hacia el desarrollo de programas para otros.</p>
<h2 id="arquitectura-de-hardware-de-ordenador">Arquitectura de hardware del ordenador </h2>
<p>Antes de comenzar a aprender el idioma que hablamos para crear software, necesitamos aprender un poco sobre c&#xF3;mo se construyen los ordenadores. Si tuviera que desarmar su ordenador o tel&#xE9;fono celular y mirar adentro, encontrar&#xED;a las siguientes partes:</p>
<figure id="fig2.1.4"><img src="../img/hardware-architecture.svg" alt="Arquitectura de hardware"><figcaption>Imagen - Arquitectura de hardware</figcaption></figure>
<p>Las definiciones de alto nivel de estas partes son las siguientes:</p>
<ul>
<li>La <strong>Unidad central de procesamiento</strong> (o CPU) es la parte de el ordenador que est&#xE1; dise&#xF1;ada para estar obsesionada con &quot;&#xBF;qu&#xE9; sigue?&quot; Si tu ordenador tiene una clasificaci&#xF3;n de 3.0 Gigahercios, significa que la CPU preguntar&#xE1; &quot;&#xBF;Qu&#xE9; sigue?&quot; Tres mil millones de veces por segundo. Tendr&#xE1;s que aprender a hablar r&#xE1;pido para mantenerse al d&#xED;a con la CPU.</li>
<li>La <strong>memoria principal</strong> se utiliza para almacenar informaci&#xF3;n que la CPU necesita a toda prisa. La memoria principal es casi tan r&#xE1;pida como la CPU. Pero la informaci&#xF3;n almacenada en la memoria principal se desvanece cuando se apaga el ordenador.</li>
<li>La <strong>memoria secundaria</strong> tambi&#xE9;n se usa para almacenar informaci&#xF3;n, pero es mucho m&#xE1;s lenta que la memoria principal. La ventaja de la memoria secundaria es que puede almacenar informaci&#xF3;n incluso cuando no hay energ&#xED;a en el ordenador. Algunos ejemplos de memoria secundaria son las unidades de disco o la memoria flash (que generalmente se encuentran en memorias USB)</li>
<li>Los <strong>Dispositivos de entrada y salida</strong> son simplemente nuestra pantalla, teclado, mouse, micr&#xF3;fono, altavoz, panel t&#xE1;ctil, etc. Son todas las formas en que interactuamos con el ordenador.</li>
<li><strong>Conexi&#xF3;n de red</strong> para recuperar informaci&#xF3;n a trav&#xE9;s de una red. Podemos pensar en la red como un lugar muy lento para almacenar y recuperar datos que pueden no estar siempre &quot;arriba&quot;. Entonces, en cierto sentido, la red es una forma m&#xE1;s lenta y en ocasiones poco confiable de <strong>Memoria secundaria</strong>.</li>
</ul>
<p>Si bien la mayor&#xED;a de los detalles de c&#xF3;mo funcionan estos componentes es mejor dejarlos en manos de los desarrolladores, es &#xFA;til tener un poco de terminolog&#xED;a para que podamos hablar sobre estas partes diferentes a medida que escribimos nuestros programas.</p>
<p>Como programador, tu trabajo consiste en utilizar y organizar cada uno de estos recursos para resolver el problema que sea y analizar los datos que obtienes de la soluci&#xF3;n. En general, estar&#xE1;s &quot;hablando&quot; con la CPU y le dir&#xE1;s qu&#xE9; hacer a continuaci&#xF3;n. A veces le dir&#xE1;s a la CPU que use la memoria principal, la memoria secundaria, la red o los dispositivos de entrada/salida.</p>
<figure id="fig2.1.5"><img src="../img/where-r-you.svg" alt="&#xBF;D&#xF3;nde est&#xE1;s?"><figcaption>Imagen - &#xBF;D&#xF3;nde est&#xE1;s?</figcaption></figure>
<p>Necesitas ser la persona que responde a la CPU &quot;&#xBF;Qu&#xE9; sigue?&quot;. Pero ser&#xED;a muy inc&#xF3;modo reducirte a una altura de 5 mm e insertarte en el ordenador solo para que puedas emitir un comando tres mil millones de veces por segundo. As&#xED; que, en lugar de eso, debes escribir tus instrucciones con anticipaci&#xF3;n. Llamamos a estas instrucciones almacenadas un <strong>programa</strong>, y al hecho de escribir estas instrucciones para que sean correctas, <strong>programaci&#xF3;n</strong>.</p>
<h2 id="comprension-programacion">Entendiendo la programaci&#xF3;n </h2>
<p>En el resto de este libro, trataremos de convertirte en una persona experta en el arte de la programaci&#xF3;n. Al final, ser&#xE1;s un <strong>programador</strong> - quiz&#xE1;s no un programador profesional, pero al menos tendr&#xE1;s las habilidades para analizar un problema de an&#xE1;lisis de datos/informaci&#xF3;n y desarrollar un programa para resolver el problema.</p>
<p>En cierto sentido, necesitas dos habilidades para ser un programador:</p>
<ul>
<li>Primero, necesitas saber el lenguaje de programaci&#xF3;n (Python) - necesitas conocer el vocabulario y la gram&#xE1;tica. Debes poder escribir correctamente las palabras en este nuevo idioma y saber c&#xF3;mo construir &quot;oraciones&quot; bien formadas en este nuevo idioma.</li>
<li>Segundo, necesitas &quot;contar una historia&quot;. Al escribir una historia, combinas palabras y oraciones para transmitir una idea al lector. Hay una habilidad y arte en la construcci&#xF3;n de la historia, y la habilidad en la escritura de la historia se mejora al escribir un poco y obtener algunos comentarios. En programaci&#xF3;n, nuestro programa es la &quot;historia&quot; y el problema que intenta resolver es la &quot;idea&quot;.</li>
</ul>
<p>Una vez que aprendas un lenguaje de programaci&#xF3;n como Python, te resultar&#xE1; mucho m&#xE1;s f&#xE1;cil aprender un segundo lenguaje de programaci&#xF3;n como JavaScript o C++. El nuevo lenguaje de programaci&#xF3;n tiene un vocabulario y gram&#xE1;tica muy diferentes, pero las habilidades de resoluci&#xF3;n de problemas ser&#xE1;n las mismas en todos los lenguajes de programaci&#xF3;n.</p>
<p>Aprender&#xE1;s el &quot;vocabulario&quot; y las &quot;oraciones&quot; de Python con bastante rapidez. Te llevar&#xE1; m&#xE1;s tiempo poder escribir un programa coherente para resolver un problema completamente nuevo. Ense&#xF1;amos la programaci&#xF3;n como ense&#xF1;amos a escribir. Comenzamos a leer y explicar programas, luego escribimos programas simples y luego escribimos programas cada vez m&#xE1;s complejos a lo largo del tiempo. En alg&#xFA;n momento, &quot;obtienes tu musa&quot; y ves los patrones por tu cuenta y puedes ver m&#xE1;s naturalmente c&#xF3;mo tomar un problema y escribir un programa que resuelva ese problema. Y una vez que llegas a ese punto, la programaci&#xF3;n se convierte en un proceso muy agradable y creativo.</p>
<p>Comenzamos con el vocabulario y la estructura de los programas de Python.</p>
<h2 id="palabras-y-oraciones">Palabras y oraciones </h2>
<p>A diferencia de las lenguas humanas, el vocabulario de Python es bastante peque&#xF1;o. Llamamos a este &quot;vocabulario&quot; las &quot;palabras reservadas&quot;. Estas son palabras que tienen un significado muy especial para Python. Cuando Python ve estas palabras en un programa de Python, tienen un solo significado para Python. Luego, a medida que escribes programas, inventar&#xE1;s sus propias palabras que tienen un significado para ti llamadas <strong>variables</strong>. Tendr&#xE1;s gran libertad para elegir tus nombres para sus variables, pero no puedes usar ninguna de las palabras reservadas de Python como nombre para una variable.</p>
<p>Cuando entrenamos a un perro, usamos palabras especiales como &quot;sentarse&quot;, &quot;quedarse&quot; y &quot;buscar&quot;. Cuando le hablas a un perro y no usas ninguna de las palabras reservadas, solo te miran con una expresi&#xF3;n burlona hasta que dices una palabra reservada. Por ejemplo, si dices: &quot;Me gustar&#xED;a que m&#xE1;s gente caminara para mejorar su salud general&quot;, lo que la mayor&#xED;a de los perros escuchan es &quot;bla bla bla <strong>caminar</strong> bla bla bla bla&quot;. Esto se debe a que &quot;caminar&quot; es una palabra reservada en lenguaje canino. Muchos podr&#xED;an sugerir que el lenguaje entre humanos y gatos no tiene palabras reservadas<sup><a href="#fn_1" id="reffn_1">1</a></sup>.</p>
<p>Las palabras reservadas en el idioma donde los humanos hablan con Python incluyen lo siguiente:</p>
<pre><code>and       del       global      not       with
as        elif      if          or        yield
assert    else      import      pass      
break     except    in          raise
class     finally   is          return
continue  for       lambda      try
def       from      nonlocal    while
</code></pre><p>Eso es todo, y a diferencia de un perro, Python ya est&#xE1; completamente entrenado. Cuando dices &quot;try&quot;, Python lo intentar&#xE1; cada vez que lo digas.</p>
<p>Aprenderemos estas palabras reservadas y c&#xF3;mo se usan a tiempo, pero por ahora nos enfocaremos en el equivalente de Python de &quot;hablar&quot; (en lenguaje humano a perro). Lo bueno de decirle a Python que hable es que incluso podemos decirle qu&#xE9; decir d&#xE1;ndole un mensaje entre comillas:</p>
<pre><code class="lang-python">    print(<span class="hljs-string">&apos;Hello world!&apos;</span>)
</code></pre>
<p>E incluso hemos escrito nuestra primera oraci&#xF3;n de Python sint&#xE1;cticamente correcta. Nuestra oraci&#xF3;n comienza con la funci&#xF3;n <strong>print</strong> (imprimir) seguida de una cadena de texto de nuestra elecci&#xF3;n entre comillas simples.</p>
<h2 id="conversing-with-python">Conversando con Python </h2>
<p>Ahora que tenemos una palabra y una oraci&#xF3;n simple que conocemos en Python, necesitamos saber c&#xF3;mo iniciar una conversaci&#xF3;n con Python para probar nuestras nuevas habilidades ling&#xFC;&#xED;sticas.</p>
<p>Antes de poder conversar con Python, primero debes instalar el software de Python en tu ordenador y aprender a iniciar Python. Esto es demasiado detallado para este cap&#xED;tulo, por lo que te sugiero que consulte [www.py4e.com] (<a href="http://www.py4e.com" target="_blank">http://www.py4e.com</a>), donde tengo instrucciones detalladas y recomendaciones para configurar e iniciar Python en sistemas Macintosh y Windows . En alg&#xFA;n momento, estar&#xE1;s en una ventana de comandos o terminal y escribir&#xE1;s <strong>python</strong> y el int&#xE9;rprete de Python comenzar&#xE1; a ejecutarse en modo interactivo. Aparecer&#xE1; de la siguiente manera:</p>
<pre><code class="lang-bash">    Python 3.5.1 (v3.5.1:37a07cee5969, Dec  6 2015, 01:54:25)
    [MSC v.1900 64 bit (AMD64)] on win32
    Type <span class="hljs-string">&quot;help&quot;</span>, <span class="hljs-string">&quot;copyright&quot;</span>, <span class="hljs-string">&quot;credits&quot;</span> or <span class="hljs-string">&quot;license&quot;</span> <span class="hljs-keyword">for</span> more information.
    &gt;&gt;&gt;
</code></pre>
<p>El indicador <code>&gt;&gt;&gt;</code> es la forma en que el int&#xE9;rprete de Python te pregunta: &quot;&#xBF;Qu&#xE9; quieres que haga ahora?&quot; Python est&#xE1; listo para tener una conversaci&#xF3;n contigo. Todo lo que tienes que saber es c&#xF3;mo hablar el idioma Python.</p>
<p>Digamos, por ejemplo, que no conoc&#xED;as ni las palabras ni las oraciones m&#xE1;s simples del lenguaje Python. Es posible que desees utilizar la l&#xED;nea est&#xE1;ndar que usan los astronautas cuando aterrizan en un planeta lejano y tratan de hablar con los habitantes del planeta:</p>
<pre><code class="lang-python">    &gt;&gt;&gt; I come <span class="hljs-keyword">in</span> peace, please take me to your leader
      File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>
        I come <span class="hljs-keyword">in</span> peace, please take me to your leader
             ^
    SyntaxError: invalid syntax
    &gt;&gt;&gt;
</code></pre>
<p>Esto no va tan bien. A menos que pienses en algo r&#xE1;pido, es probable que los habitantes del planeta te apu&#xF1;alen con sus lanzas, te pongan a escupir, te asen al fuego y te coman para la cena.</p>
<p>Afortunadamente, trajiste una copia de este libro en tus viajes, y accedes a esta misma p&#xE1;gina e intentas nuevamente:</p>
<pre><code class="lang-python">    &gt;&gt;&gt; print(<span class="hljs-string">&apos;Hello world!&apos;</span>)
    Hello world!
</code></pre>
<p>Esto se ve mucho mejor, as&#xED; que intenta comunicar algo m&#xE1;s:</p>
<pre><code class="lang-python">    &gt;&gt;&gt; print(&apos;You must be the legendary god that comes from the sky&apos;)
    You must be the legendary god that comes from the sky
    &gt;&gt;&gt; print(&apos;We have been waiting for you for a long time&apos;)
    We have been waiting for you for a long time
    &gt;&gt;&gt; print(&apos;Our legend says you will be very tasty with mustard&apos;)
    Our legend says you will be very tasty with mustard
    &gt;&gt;&gt; print &apos;We will have a feast tonight unless you say
      File &quot;&lt;stdin&gt;&quot;, line 1
        print &apos;We will have a feast tonight unless you say
                                                         ^
    SyntaxError: Missing parentheses in call to &apos;print&apos;
    &gt;&gt;&gt;
</code></pre>
<p>La conversaci&#xF3;n transcurri&#xF3; muy bien durante un tiempo y luego cometiste el m&#xE1;s m&#xED;nimo error al usar el lenguaje y Python sac&#xF3; las lanzas.</p>
<p>En este punto, tambi&#xE9;n debes darte cuenta de que, si bien Python es incre&#xED;blemente complejo, poderoso y muy exigente con la sintaxis que utilizas para comunicarte con &#xE9;l, Python no es <strong>inteligente</strong>. Realmente solo est&#xE1;s teniendo una conversaci&#xF3;n contigo mismo, pero usando la sintaxis adecuada.</p>
<p>En cierto sentido, cuando utilizas un programa escrito por otra persona, la conversaci&#xF3;n es entre usted y los otros programadores con Python que act&#xFA;a como intermediario. Python es una forma para que los creadores de programas expresen c&#xF3;mo se supone que la conversaci&#xF3;n debe continuar. Y en unos pocos cap&#xED;tulos m&#xE1;s, ser&#xE1;s uno de esos programadores que usan Python para hablar con los usuarios de tu programa.</p>
<p>Antes de dejar nuestra primera conversaci&#xF3;n con el int&#xE9;rprete de Python, probablemente debas saber la forma correcta de decir &quot;adi&#xF3;s&quot; cuando interact&#xFA;as con los habitantes de Planet Python:</p>
<pre><code class="lang-python">    &gt;&gt;&gt; good-bye
    Traceback (most recent call last):
      File &quot;&lt;stdin&gt;&quot;, line 1, in &lt;module&gt;
    NameError: name &apos;good&apos; is not defined
    &gt;&gt;&gt; if you don&apos;t mind, I need to leave
      File &quot;&lt;stdin&gt;&quot;, line 1
        if you don&apos;t mind, I need to leave
                 ^
    SyntaxError: invalid syntax
    &gt;&gt;&gt; quit()
</code></pre>
<p>Notar&#xE1;s que el error es diferente para los dos primeros intentos incorrectos. El segundo error es diferente porque <strong>if</strong> es una palabra reservada y Python vio la palabra reservada y pens&#xF3; que est&#xE1;bamos tratando de decir algo, pero te equivocaste en la sintaxis de la oraci&#xF3;n.</p>
<p>La forma correcta de decir &quot;adi&#xF3;s&quot; a Python es ingresar <strong>quit()</strong> en el indicador interactivo <code>&gt;&gt;&gt;</code>. Probablemente te haya tomado bastante tiempo adivinarlo, por lo que tener un libro a la mano probablemente te resulte &#xFA;til.</p>
<h2 id="terminolog&#xED;a-interprete-y-compilador">Terminolog&#xED;a: int&#xE9;rprete y compilador </h2>
<p>Python es un lenguaje <strong>de alto nivel</strong> destinado a ser relativamente sencillo para que los humanos lean y escriban y para que los ordenadores lean y procesen. Otros lenguajes de alto nivel incluyen Java, C ++, PHP, Ruby, Basic, Perl, JavaScript y muchos m&#xE1;s. El hardware real dentro de la Unidad Central de Procesamiento (CPU) no comprende ninguno de estos lenguajes de alto nivel.</p>
<p>La CPU entiende un idioma que llamamos <strong>lenguaje de m&#xE1;quina</strong>. El lenguaje de m&#xE1;quina es muy simple y francamente muy tedioso de escribir porque est&#xE1; representado en ceros y unos:</p>
<pre><code class="lang-bash">    001010001110100100101010000001111
    11100110000011101010010101101101
    ...
</code></pre>
<p>El lenguaje de m&#xE1;quina parece bastante simple en la superficie, dado que solo hay ceros y unos, pero su sintaxis es a&#xFA;n m&#xE1;s compleja y mucho m&#xE1;s compleja que Python. Muy pocos programadores escriben lenguaje de m&#xE1;quina. En su lugar, creamos varios traductores para permitir que los programadores escriban en lenguajes de alto nivel como Python o JavaScript y estos traductores convierten los programas al lenguaje de m&#xE1;quina para su ejecuci&#xF3;n real por parte de la CPU.</p>
<p>Dado que el lenguaje de la m&#xE1;quina est&#xE1; vinculado al hardware de el ordenador, el lenguaje de la m&#xE1;quina no es <strong>port&#xE1;til</strong> a trav&#xE9;s de diferentes tipos de hardware. Los programas escritos en lenguajes de alto nivel se pueden mover entre diferentes ordenadors utilizando un int&#xE9;rprete diferente en la nueva m&#xE1;quina o compilando el c&#xF3;digo para crear una versi&#xF3;n del programa en la m&#xE1;quina.</p>
<p>Estos traductores de lenguaje de programaci&#xF3;n se dividen en dos categor&#xED;as generales: (1) int&#xE9;rpretes y (2) compiladores.</p>
<p>Un <strong>int&#xE9;rprete</strong> lee el c&#xF3;digo fuente del programa como est&#xE1; escrito por el programador, analiza el c&#xF3;digo fuente e interpreta las instrucciones sobre la marcha. Python es un int&#xE9;rprete y cuando ejecutamos Python de forma interactiva, podemos escribir una l&#xED;nea de Python (una oraci&#xF3;n) y Python la procesa de inmediato y est&#xE1; lista para que escribamos otra l&#xED;nea de Python.</p>
<p>Algunas de las l&#xED;neas le dicen a Python que quieres que recuerde alg&#xFA;n valor para m&#xE1;s adelante. Necesitamos elegir un nombre para que se recuerde ese valor y podemos usar ese nombre simb&#xF3;lico para recuperar el valor m&#xE1;s adelante. Utilizamos el t&#xE9;rmino <strong>variable</strong> para referirnos a las etiquetas que usamos para estos datos almacenados.</p>
<pre><code class="lang-python">    &gt;&gt;&gt; x = <span class="hljs-number">6</span>
    &gt;&gt;&gt; print(x)
    <span class="hljs-number">6</span>
    &gt;&gt;&gt; y = x * <span class="hljs-number">7</span>
    &gt;&gt;&gt; print(y)
    <span class="hljs-number">42</span>
    &gt;&gt;&gt;
</code></pre>
<p>En este ejemplo, le pedimos a Python que recuerde el valor seis y use la etiqueta <strong>x</strong> para poder recuperar el valor m&#xE1;s adelante. Verificamos que Python realmente haya recordado el valor utilizando <strong>print</strong>. Luego le pedimos a Python que recupere <strong>x</strong> y lo multiplique por siete y ponga el nuevo valor calculado en <strong>y</strong>. Luego le pedimos a Python que imprima el valor actualmente en <strong>y</strong>.</p>
<p>Aunque estamos escribiendo estos comandos en Python una l&#xED;nea a la vez, Python los trata como una secuencia ordenada de declaraciones, con declaraciones posteriores que pueden recuperar datos creados anteriomente. Estamos escribiendo nuestro primer p&#xE1;rrafo simple con cuatro oraciones en un orden l&#xF3;gico y significativo.</p>
<p>Est&#xE1; en la naturaleza de un <strong>int&#xE9;rprete</strong> poder tener una conversaci&#xF3;n interactiva como se muestra arriba. A un <strong>compilador</strong> debemos entregarle todo el programa en un archivo, y luego ejecuta un proceso para traducir el c&#xF3;digo fuente de alto nivel al lenguaje de m&#xE1;quina y luego el compilador coloca el lenguaje de m&#xE1;quina resultante en un archivo para su posterior ejecuci&#xF3;n.</p>
<p>Si tienes un sistema Windows, a menudo estos programas de lenguaje de m&#xE1;quina ejecutable tienen un sufijo de &quot;.exe&quot; o &quot;.dll&quot; que significa &quot;ejecutable&quot; y &quot;biblioteca de enlace din&#xE1;mico&quot; respectivamente. En Linux y Macintosh, no hay ning&#xFA;n sufijo que marque de forma &#xFA;nica un archivo como ejecutable.</p>
<p>Si fueras a abrir un archivo ejecutable en un editor de texto, se ver&#xED;a completamente loco y ser&#xED;a ilegible:</p>
<pre><code class="lang-bash">    ^?ELF^A^A^A^@^@^@^@^@^@^@^@^@^B^@^C^@^A^@^@^@\xa0\x82
    ^D^H4^@^@^@\x90^]^@^@^@^@^@^@4^@ ^@^G^@(^@$^@!^@^F^@
    ^@^@4^@^@^@4\x80^D^H4\x80^D^H\xe0^@^@^@\xe0^@^@^@^E
    ^@^@^@^D^@^@^@^C^@^@^@^T^A^@^@^T\x81^D^H^T\x81^D^H^S
    ^@^@^@^S^@^@^@^D^@^@^@^A^@^@^@^A\^D^HQVhT\x83^D^H\xe8
    ....
</code></pre>
<p>No es f&#xE1;cil leer o escribir lenguaje de m&#xE1;quina, por lo que es bueno que tengamos <strong>int&#xE9;rpretes</strong> y <strong>compiladores</strong> que nos permiten escribir en lenguajes de alto nivel como Python o C.</p>
<p>Ahora, en este punto de nuestra discusi&#xF3;n sobre compiladores e int&#xE9;rpretes, deber&#xED;as preguntarte un poco sobre el int&#xE9;rprete de Python. &#xBF;En qu&#xE9; idioma est&#xE1; escrito? &#xBF;Est&#xE1; escrito en un lenguaje compilado? Cuando escribimos &quot;python&quot;, &#xBF;qu&#xE9; est&#xE1; sucediendo exactamente?</p>
<p>El int&#xE9;rprete de Python est&#xE1; escrito en un lenguaje de alto nivel llamado &quot;C&quot;. Puede consultar el c&#xF3;digo fuente real del int&#xE9;rprete de Python en [www.python.org] (<a href="http://www.python.org" target="_blank">http://www.python.org</a>). Entonces, Python es un programa en s&#xED; mismo y est&#xE1; compilado en c&#xF3;digo de m&#xE1;quina. Cuando instal&#xF3; Python en su ordenador (o el proveedor lo instal&#xF3;), hizo una copia en c&#xF3;digo de m&#xE1;quina del programa Python traducido en su sistema. En Windows, el c&#xF3;digo de m&#xE1;quina ejecutable para Python en s&#xED; mismo es probablemente un archivo con un nombre como:</p>
<pre><code class="lang-bash">    C:\Python37\python.exe
</code></pre>
<p>Eso es m&#xE1;s de lo que realmente necesitas saber para ser un programador de Python, pero a veces vale la pena responder esas peque&#xF1;as y molestas preguntas desde el principio.</p>
<h2 id="writing-a-program">Escribiendo un programa </h2>
<p>Escribir comandos en el int&#xE9;rprete de Python es una excelente manera de experimentar con las funciones de Python, pero no se recomienda para resolver problemas m&#xE1;s complejos.</p>
<p>Cuando queremos escribir un programa, usamos un editor de texto para escribir las instrucciones de Python en un archivo, que se denomina un <strong>script</strong>. Por convenci&#xF3;n, los scripts de Python tienen nombres que terminan con <code>.py</code>.</p>
<p>Para ejecutar el script, debes decirle al int&#xE9;rprete de Python el nombre del archivo. En una ventana de comandos de Unix o Windows, escribir&#xED;as <code>python hello.py</code> de la siguiente manera:</p>
<pre><code class="lang-python">    csev$ cat hello.py
    print(<span class="hljs-string">&apos;Hello world!&apos;</span>)
    csev$ python hello.py
    Hello world!
    csev$
</code></pre>
<p>El &quot;csev $&quot; es el indicador del sistema operativo y el &quot;cat hello.py&quot; nos muestra que el archivo &quot;hello.py&quot; tiene un programa de Python de una l&#xED;nea para imprimir una cadena.</p>
<p>Llamamos al int&#xE9;rprete de Python y le decimos que lea el c&#xF3;digo fuente del archivo &quot;hello.py&quot; en lugar de pedirnos l&#xED;neas interactivas de c&#xF3;digo de Python.</p>
<p>Notar&#xE1;s que no hab&#xED;a necesidad de tener <strong>quit()</strong> al final del programa Python en el archivo. Cuando Python est&#xE1; leyendo el c&#xF3;digo fuente de un archivo, sabe que debe detenerse cuando llega al final del archivo.</p>
<h2 id="what-is-a-program">&#xBF;Qu&#xE9; es un programa? </h2>
<p>La definici&#xF3;n de un <strong>programa</strong> en su forma m&#xE1;s b&#xE1;sica es una secuencia de sentencias de Python que se han creado para hacer algo. Incluso nuestro sencillo script <strong>hello.py</strong> es un programa. Es un programa de una l&#xED;nea y no es particularmente &#xFA;til, pero en la definici&#xF3;n m&#xE1;s estricta, es un programa de Python.</p>
<p>Podr&#xED;a ser m&#xE1;s f&#xE1;cil entender qu&#xE9; es un programa pensando en un problema para el cual se podr&#xED;a construir un programa, y &#x200B;&#x200B;luego mirando un programa que solucione ese problema.</p>
<p>Digamos que est&#xE1;s haciendo una investigaci&#xF3;n de Computaci&#xF3;n Social en las publicaciones de Facebook y est&#xE1;s interesado en la palabra m&#xE1;s utilizada en una serie de publicaciones. Podr&#xED;as imprimir la corriente de publicaciones de Facebook y estudiar detenidamente el texto buscando la palabra m&#xE1;s com&#xFA;n, pero eso llevar&#xED;a mucho tiempo y ser&#xED;a muy propenso a errores. Ser&#xED;a inteligente escribir un programa Python para manejar la tarea de manera r&#xE1;pida y precisa, de modo que puedas pasar el fin de semana haciendo algo divertido.</p>
<p>Por ejemplo, mira el siguiente texto sobre un payaso y un autom&#xF3;vil. Calcula la palabra m&#xE1;s com&#xFA;n y cu&#xE1;ntas veces aparece.</p>
<pre><code class="lang-bash">    the clown ran after the car and the car ran into the tent
    and the tent fell down on the clown and the car
</code></pre>
<p>Luego imagina que est&#xE1;s haciendo esta tarea mirando millones de l&#xED;neas de texto. Francamente, ser&#xED;a m&#xE1;s r&#xE1;pido aprender Python y escribir un programa Python para contar las palabras que escanearlas manualmente.</p>
<p>La noticia a&#xFA;n mejor es que ya se me ocurri&#xF3; un programa simple para encontrar la palabra m&#xE1;s com&#xFA;n en un archivo de texto. Lo escrib&#xED;, lo prob&#xE9; y ahora te lo doy para que lo uses y puedas ahorrar algo de tiempo.</p>
<iframe src="https://trinket.io/embed/python3/d51dc614a8" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>Ni siquiera necesitas saber Python para usar este programa. Deber&#xE1;s leer el Cap&#xED;tulo 10 de este libro para comprender completamente las impresionantes t&#xE9;cnicas de Python que se utilizaron para crear el programa. T&#xFA; eres el usuario final, simplemente utiliza el programa y disfruta de su inteligencia y de c&#xF3;mo te ahorr&#xF3; tanto esfuerzo manual. Simplemente escribe el c&#xF3;digo en un archivo llamado <strong>words.py</strong> y ejec&#xFA;talo o desc&#xE1;rgate el c&#xF3;digo fuente de <a href="https://www.py4e.com/code3/" target="_blank">https://www.py4e.com/code3/</a> y ejec&#xFA;talo.</p>
<p>Este es un buen ejemplo de c&#xF3;mo Python act&#xFA;a como intermediario entre t&#xFA; (el usuario final) y yo (el programador). Python es una forma de intercambiar secuencias de instrucciones &#xFA;tiles (es decir, programas) en un lenguaje com&#xFA;n que puede ser utilizado por cualquier persona que instale Python en su ordenador. As&#xED; que ninguno de los dos est&#xE1; hablando <strong>con Python</strong>, en lugar de eso, nos estamos comunicando unos con otros <strong>a trav&#xE9;s de</strong> Python.</p>
<h2 id="the-building-blocks-of-programs">Los componentes b&#xE1;sicos de los programas </h2>
<p>En los siguientes cap&#xED;tulos, aprenderemos m&#xE1;s sobre el vocabulario, la estructura de las oraciones, la estructura de los p&#xE1;rrafos y la estructura de la historia de Python. Aprenderemos sobre las potentes capacidades de Python y c&#xF3;mo usarlas para crear programas &#xFA;tiles.</p>
<p>Hay algunos patrones conceptuales de bajo nivel que utilizamos para construir programas. Estas construcciones no son solo para programas de Python, sino que forman parte de todos los lenguajes de programaci&#xF3;n, desde el lenguaje de m&#xE1;quina hasta los lenguajes de alto nivel.</p>
<h4 id="entrada-input">entrada (input)</h4>
<p>Obtener datos del &quot;mundo exterior&quot;. Esto podr&#xED;a ser leer datos de un archivo, o incluso alg&#xFA;n tipo de sensor como un micr&#xF3;fono o un GPS. En nuestros programas iniciales, nuestra entrada provendr&#xE1; del usuario que escribe datos en el teclado.</p>
<h4 id="salida-output">salida (output)</h4>
<p>Muestra los resultados del programa en una pantalla o gu&#xE1;rdalos en un archivo o tal vez env&#xED;alos a un dispositivo como un altavoz para reproducir m&#xFA;sica o leer texto.</p>
<h4 id="ejecuci&#xF3;n-secuencial">ejecuci&#xF3;n secuencial</h4>
<p>Realiza las instrucciones una tras otra en el orden en que se encuentran en el script.</p>
<h4 id="ejecuci&#xF3;n-condicional">ejecuci&#xF3;n condicional</h4>
<p>Verifica ciertas condiciones y luego ejecuta u omite una secuencia de sentencias.</p>
<h4 id="ejecuci&#xF3;n-iterativa">ejecuci&#xF3;n iterativa</h4>
<p>Realizar alg&#xFA;n conjunto de declaraciones repetidamente, generalmente con alguna variaci&#xF3;n.</p>
<h4 id="reutilizar">reutilizar</h4>
<p>Escribe un conjunto de instrucciones una vez y dales un nombre. Luego reutiliza esas instrucciones seg&#xFA;n sea necesario en todo el programa.</p>
<p>Suena casi demasiado simple para ser verdad, y por supuesto nunca es tan simple. Es como decir que caminar es simplemente &quot;poner un pie delante del otro&quot;. El &quot;arte&quot; de escribir un programa es componer y tejer estos elementos b&#xE1;sicos juntos muchas veces para producir algo que sea &#xFA;til para sus usuarios.</p>
<p>El programa de conteo de palabras de arriba usa directamente todos estos patrones excepto uno.</p>
<h2 id="what-could-possibly-go-wrong">&#xBF;Qu&#xE9; podr&#xED;a salir mal? </h2>
<p>Como vimos en nuestras primeras conversaciones con Python, debemos comunicarnos con mucha precisi&#xF3;n cuando escribimos el c&#xF3;digo de Python. La desviaci&#xF3;n o error m&#xE1;s peque&#xF1;o har&#xE1; que Python deje de mirar tu programa.</p>
<p>Los programadores principiantes a menudo toman el hecho de que Python no deja espacio para errores como evidencia de que Python es malo, odioso y cruel. Si bien a Python parece gustarle todo el mundo, Python en realidad los conoce personalmente y guarda rencor contra ellos. Debido a este rencor, Python toma nuestros programas perfectamente escritos y los rechaza como &quot;no aptos&quot; solo para atormentarnos.</p>
<pre><code class="lang-python">    &gt;&gt;&gt; primt <span class="hljs-string">&apos;Hello world!&apos;</span>
      File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>
        primt <span class="hljs-string">&apos;Hello world!&apos;</span>
                           ^
    SyntaxError: invalid syntax
    &gt;&gt;&gt; primt (<span class="hljs-string">&apos;Hello world&apos;</span>)
    Traceback (most recent call last):
    File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
    NameError: name <span class="hljs-string">&apos;primt&apos;</span> <span class="hljs-keyword">is</span> <span class="hljs-keyword">not</span> defined

    &gt;&gt;&gt; I hate you Python!
      File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>
        I hate you Python!
             ^
    SyntaxError: invalid syntax
    &gt;&gt;&gt; <span class="hljs-keyword">if</span> you come out of there, I would teach you a lesson
      File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>
        <span class="hljs-keyword">if</span> you come out of there, I would teach you a lesson
                  ^
    SyntaxError: invalid syntax
    &gt;&gt;&gt;
</code></pre>
<p>Hay poco que ganar discutiendo con Python. Es solo una herramienta. No tiene emociones y est&#xE1; listo para servirte cuando lo necesite. Sus mensajes de error suenan &#xE1;speros, pero son solo la llamada de ayuda de Python. Ha examinado lo que escribiste y simplemente no puede entender lo que has ingresado.</p>
<p>Python es mucho m&#xE1;s como un perro, te ama incondicionalmente, tiene algunas palabras clave que entiende, te mira con una mirada dulce en su cara (<code>&gt;&gt;&gt;</code>), y te espera para que digas algo que entiendas. Cuando Python dice &quot;SyntaxError: sintaxis no v&#xE1;lida&quot;, simplemente mueve la cola y dice: &quot;Parec&#xED;as decir algo, pero no entiendo lo que quisiste decir, pero sigue hablando (<code>&gt;&gt;&gt;</code>).&quot;</p>
<p>A medida que sus programas se vuelven cada vez m&#xE1;s sofisticados, encontrar&#xE1; tres tipos generales de errores:</p>
<h4 id="errores-sint&#xE1;cticos">Errores sint&#xE1;cticos</h4>
<p>Estos son los primeros errores que cometer&#xE1;s y los m&#xE1;s f&#xE1;ciles de corregir. Un error de sintaxis significa que has violado las reglas de &quot;sintaxis&quot; de Python. Python hace todo lo posible para se&#xF1;alar la l&#xED;nea y el car&#xE1;cter en el que not&#xF3; que estabas confundido. La &#xFA;nica parte dif&#xED;cil de los errores de sintaxis es que, a veces, el error que debe solucionarse es, en realidad, m&#xE1;s temprano en el programa que en el que Python not&#xF3; que estabas confundido. Por lo tanto, la l&#xED;nea y el car&#xE1;cter que Python indica en un error de sintaxis pueden ser solo un punto de partida para tu investigaci&#xF3;n.</p>
<h4 id="errores-l&#xF3;gicos">Errores l&#xF3;gicos</h4>
<p>Un error l&#xF3;gico es cuando su programa tiene una buena sintaxis pero hay un error en el orden de las declaraciones o quiz&#xE1;s un error en la forma en que las declaraciones se relacionan entre s&#xED;. Un buen ejemplo de un error l&#xF3;gico podr&#xED;a ser: &quot;tome un trago de su botella de agua, col&#xF3;quelo en su mochila, camine hasta la biblioteca y luego vuelva a colocar la tapa en la botella&quot;.</p>
<h4 id="errores-sem&#xE1;nticos">Errores sem&#xE1;nticos</h4>
<p>Un error sem&#xE1;ntico es cuando tu descripci&#xF3;n de los pasos a seguir es sint&#xE1;cticamente perfecta y en el orden correcto, pero simplemente hay un error en el programa. El programa es perfectamente correcto, pero no hace lo que t&#xFA; <strong>quer&#xED;as</strong> que haga. Un ejemplo simple ser&#xED;a si le dieras a una persona instrucciones para llegar a un restaurante y dijeras: &quot;... cuando llegue a la intersecci&#xF3;n con la estaci&#xF3;n de servicio, gire a la izquierda y avance una milla y el restaurante es un edificio rojo a su izquierda&quot;. Su amigo llega tarde y lo llama para decirle que est&#xE1; en una granja y que est&#xE1; caminando detr&#xE1;s de un granero, sin ninguna se&#xF1;al de restaurante. Entonces dices &quot;&#xBF;giraste a la izquierda o a la derecha en la estaci&#xF3;n de servicio?&quot; y dicen: &quot;Segu&#xED; tus instrucciones a la perfecci&#xF3;n, las tengo escritas, dice: gira a la izquierda y ve una milla en la gasolinera&quot;. Luego dices: &quot;Lo siento mucho, porque aunque mis instrucciones fueron sint&#xE1;cticamente correctas, tristemente conten&#xED;an un error sem&#xE1;ntico peque&#xF1;o pero no detectado&quot;.</p>
<p>Nuevamente, en los tres tipos de errores, Python simplemente est&#xE1; haciendo todo lo posible por hacer exactamente lo que t&#xFA; pediste.</p>
<h2 id="the-learning-journey">El viaje del aprendizaje </h2>
<p>A medida que avance en el resto del libro, no tengas miedo si los conceptos no parecen encajar bien a la primera. Cuando estabas aprendiendo a hablar, no fue un problema durante los primeros a&#xF1;os que hicieras ruidos de gorgoteo. Y estuvo bien si tardaste seis meses en pasar de un vocabulario simple a oraciones simples y tardaste 5-6 a&#xF1;os m&#xE1;s en pasar de las oraciones a los p&#xE1;rrafos, y algunos a&#xF1;os m&#xE1;s para poder escribir un cuento completo completo interesante en t&#xFA; s&#xF3;lo.</p>
<p>Queremos que aprendas Python mucho m&#xE1;s r&#xE1;pido, por lo que ense&#xF1;amos todo al mismo tiempo en los pr&#xF3;ximos cap&#xED;tulos. Pero es como aprender un nuevo idioma que toma tiempo absorber y entender antes de que se sienta natural. Esto nos lleva a cierta confusi&#xF3;n a medida que visitamos y revisamos los temas para tratar de que veas el panorama general mientras definimos los peque&#xF1;os fragmentos que conforman ese panorama general. Si bien el libro est&#xE1; escrito de manera lineal, y si est&#xE1;s tomando un curso, progresar&#xE1;s de manera lineal, no dudes en ser muy no lineal en la forma en que abordas el material. Mira hacia adelante y hacia atr&#xE1;s y lee con ligereza. Al hojear material m&#xE1;s avanzado sin comprender completamente los detalles, puedes comprender mejor el &quot;&#xBF;por qu&#xE9;?&quot; de la programaci&#xF3;n. Al revisar el material anterior e incluso rehacer ejercicios anteriores, te dar&#xE1;s cuenta de que realmente aprendiste mucho, incluso si el material que est&#xE1;s mirando actualmente parece un poco impenetrable.</p>
<p>Por lo general, cuando est&#xE1;s aprendiendo tu primer lenguaje de programaci&#xF3;n, hay algunos maravillosos momentos &quot;&#xA1;Ah Hah!&quot; en los que puedes mirar desde una roca con un martillo y un cincel, alejarte, y ver que de hecho est&#xE1;s construyendo una hermosa escultura.</p>
<p>Si algo parece particularmente dif&#xED;cil, generalmente merece la pena permanecer despierto toda la noche y mirarlo fijamente. Toma un descanso, toma una siesta, toma un refrigerio, expl&#xED;cale a alguien (o quiz&#xE1;s a tu perro) con qu&#xE9; est&#xE1; teniendo problemas y luego vuelve con los ojos frescos. Te aseguro que una vez que aprendas los conceptos de programaci&#xF3;n en el libro, mirar&#xE1;s hacia atr&#xE1;s y ver&#xE1;s que todo fue realmente f&#xE1;cil y elegante, y que simplemente te tom&#xF3; un poco de tiempo absorberlo.</p>
<h2 id="ejercicios">Ejercicios (voluntarios y sin correcci&#xF3;n) </h2>
<p><strong>Ejercicio 1</strong>: &#xBF;Cu&#xE1;l es la funci&#xF3;n de la memoria secundaria en un ordenador?</p>
<p>a) Ejecutar todos los c&#xE1;lculos y la l&#xF3;gica del programa <br> b) Recuperar p&#xE1;ginas web a trav&#xE9;s de Internet <br> c) Almacenar informaci&#xF3;n a largo plazo, incluso m&#xE1;s all&#xE1; de un ciclo de alimentaci&#xF3;n <br> d) Tomar informaci&#xF3;n del usuario</p>
<p><strong>Ejercicio 2</strong>: &#xBF;Qu&#xE9; es un programa?</p>
<p><strong>Ejercicio 3</strong>: &#xBF;Cu&#xE1;l es la diferencia entre un compilador y un int&#xE9;rprete?</p>
<p><strong>Ejercicio 4</strong>: &#xBF;Cu&#xE1;l de los siguientes contiene &quot;c&#xF3;digo de m&#xE1;quina&quot;?</p>
<p>a) El int&#xE9;rprete de Python <br> b) El teclado <br> c) Archivo fuente de Python <br> d) Un documento de procesamiento de texto</p>
<p><strong>Ejercicio 5</strong>: &#xBF;Qu&#xE9; est&#xE1; mal en el siguiente c&#xF3;digo?</p>
<pre><code class="lang-python">    &gt;&gt;&gt; primt <span class="hljs-string">&apos;Hello world!&apos;</span>
      File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>
        primt <span class="hljs-string">&apos;Hello world!&apos;</span>
                           ^
    SyntaxError: invalid syntax
    &gt;&gt;&gt;
</code></pre>
<p><strong>Ejercicio 6</strong>: &#xBF;En qu&#xE9; parte de el ordenador hay una variable como &quot;x&quot; almacenada despu&#xE9;s de que termina la siguiente l&#xED;nea de Python?</p>
<pre><code class="lang-python">    x = <span class="hljs-number">123</span>
</code></pre>
<p>a) Unidad de procesamiento central <br> b) Memoria principal <br> c) Memoria secundaria <br> d) Dispositivos de entrada <br> e) Dispositivos de salida</p>
<p><strong>Ejercicio 7</strong>: &#xBF;Qu&#xE9; imprimir&#xE1; el siguiente programa?</p>
<pre><code class="lang-python">    x = <span class="hljs-number">43</span>
    x = x + <span class="hljs-number">1</span>
    print(x)
</code></pre>
<p>a) 43 <br> b) 44 <br> c) x + 1 <br> d) Error porque x = x + 1 no es posible matem&#xE1;ticamente</p>
<p><strong>Ejercicio 8</strong>: Explique cada uno de los siguientes ejemplos con un ejemplo de una capacidad humana: (1) Unidad central de procesamiento, (2) Memoria principal, (3) Memoria secundaria, (4) Dispositivo de entrada y (5) Dispositivo de salida. Por ejemplo, &quot;&#xBF;Cu&#xE1;l es el equivalente humano a una unidad central de procesamiento?&quot;</p>
<p><strong>Ejercicio 9</strong>: &#xBF;C&#xF3;mo arreglas un &quot;Error de sintaxis&quot;?</p>
<hr>
<blockquote id="fn_1">
<sup>1</sup>. <a href="http://xkcd.com/231/" target="_blank">http://xkcd.com/231/</a><a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>
<p></p><div id="page-footer" class="localized-footer"><hr><p><a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank"><img alt="Licencia de Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by-nc-sa/4.0/80x15.png"></a><br><span xmlns:dct="http://purl.org/dc/terms/" property="dct:title">Python for person in everybody</span>, escrito a partir del libro <a rel="license" href="https://www.py4e.com/book" target="_blank">&apos;Python for Everybody&apos;</a> por <span xmlns:cc="http://creativecommons.org/ns#" property="cc:attributionName"><a rel="license" href="http://www.dr-chuck.com/" target="_blank">Charles R. Severance</a></span> bajo licencia <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">Creative Commons Reconocimiento-NoComercial-CompartirIgual 4.0 Internacional License</a>.</p>
</div><p></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introducción">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02-variables.html" class="navigation navigation-next " aria-label="Next page: 2. Variables">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1. Comenzando el camino","level":"2.1","depth":1,"next":{"title":"2. Variables","level":"2.2","depth":1,"path":"02-variables.md","ref":"02-variables.md","articles":[]},"previous":{"title":"Introducción","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["youtube","image-captions","accordion","styled-blockquotes","localized-footer","edit-link","githubcontributors","language-picker","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"language-picker":{"grid-columns":3},"youtube":{},"accordion":{},"search":{},"styled-blockquotes":{},"localized-footer":{"filename":"./FOOTER.md","hline":true},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"ga":{"configuration":"auto","token":"UA-135691041-2"},"githubcontributors":{"contributorWidth":"300px","githubOwner":"catedu","githubRepository":"python-for-person-in-everybody"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":{"en":"Edit this page","es":"Edita esta página"},"base":"https://github.com/catedu/python-for-person-in-everybody/edit/master/"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"image-captions":{"caption":"Imagen - _CAPTION_","variable_name":"_pictures"}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"title":"Python for person in everybody","author":"Charles R. Severance","collaborators":[{"name":"_________","edited":"_____________"}],"_pictures":[{"backlink":"01-intro.html#fig2.1.1","level":"2.1","list_caption":"Figure: Instalando Python","alt":"Instalando Python","nro":1,"url":"https://deleyva.gitbooks.io/automatiza-tu-aprendizaje-con-python/content/img/python-path.png","index":1,"caption_template":"Imagen - _CAPTION_","label":"Instalando Python","attributes":{},"skip":false,"key":"2.1.1"},{"backlink":"01-intro.html#fig2.1.2","level":"2.1","list_caption":"Figure: Asistente personal digital","alt":"Asistente personal digital","nro":2,"url":"../img/descarga.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Asistente personal digital","attributes":{},"skip":false,"key":"2.1.2"},{"backlink":"01-intro.html#fig2.1.3","level":"2.1","list_caption":"Figure: Programadores hablando contigo","alt":"Programadores hablando contigo","nro":3,"url":"../img/programers-talking-to-you.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Programadores hablando contigo","attributes":{},"skip":false,"key":"2.1.3"},{"backlink":"01-intro.html#fig2.1.4","level":"2.1","list_caption":"Figure: Arquitectura de hardware","alt":"Arquitectura de hardware","nro":4,"url":"../img/hardware-architecture.svg","index":4,"caption_template":"Imagen - _CAPTION_","label":"Arquitectura de hardware","attributes":{},"skip":false,"key":"2.1.4"},{"backlink":"01-intro.html#fig2.1.5","level":"2.1","list_caption":"Figure: ¿Dónde estás?","alt":"¿Dónde estás?","nro":5,"url":"../img/where-r-you.svg","index":5,"caption_template":"Imagen - _CAPTION_","label":"¿Dónde estás?","attributes":{},"skip":false,"key":"2.1.5"},{"backlink":"03-conditional.html#fig2.3.1","level":"2.3","list_caption":"Figure: Si logica","alt":"Si logica","nro":6,"url":"../img/if.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Si logica","attributes":{},"skip":false,"key":"2.3.1"},{"backlink":"03-conditional.html#fig2.3.2","level":"2.3","list_caption":"Figure: Lógica de If-Then-Else","alt":"Lógica de If-Then-Else","nro":7,"url":"../img/if-else.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Lógica de If-Then-Else","attributes":{},"skip":false,"key":"2.3.2"},{"backlink":"03-conditional.html#fig2.3.3","level":"2.3","list_caption":"Figure: Lógica de elif","alt":"Lógica de elif","nro":8,"url":"../img/elif.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Lógica de elif","attributes":{},"skip":false,"key":"2.3.3"},{"backlink":"03-conditional.html#fig2.3.4","level":"2.3","list_caption":"Figure: Nested If Statements","alt":"Nested If Statements","nro":9,"url":"../img/nested.svg","index":4,"caption_template":"Imagen - _CAPTION_","label":"Nested If Statements","attributes":{},"skip":false,"key":"2.3.4"},{"backlink":"06-strings.html#fig2.6.1","level":"2.6","list_caption":"Figure: String Indexes","alt":"String Indexes","nro":10,"url":"../img/banana.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"String Indexes","attributes":{},"skip":false,"key":"2.6.1"},{"backlink":"07-files.html#fig2.7.1","level":"2.7","list_caption":"Figure: Memoria secundaria","alt":"Memoria secundaria","nro":11,"url":"../img/seconday_memory.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Memoria secundaria","attributes":{},"skip":false,"key":"2.7.1"},{"backlink":"07-files.html#fig2.7.2","level":"2.7","list_caption":"Figure: A File Handle","alt":"A File Handle","nro":12,"url":"../img/file-handle.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"A File Handle","attributes":{},"skip":false,"key":"2.7.2"},{"backlink":"08-lists.html#fig2.8.1","level":"2.8","list_caption":"Figure: Variables y objetos","alt":"Variables y objetos","nro":13,"url":"../img/variables-objects.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Variables y objetos","attributes":{},"skip":false,"key":"2.8.1"},{"backlink":"12-network.html#fig2.12.1","level":"2.12","list_caption":"Figure: A Socket Connection","alt":"A Socket Connection","nro":14,"url":"../img/socket.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"A Socket Connection","attributes":{},"skip":false,"key":"2.12.1"},{"backlink":"13-web.html#fig2.13.1","level":"2.13","list_caption":"Figure: Una representación en árbol de XML","alt":"Una representación en árbol de XML","nro":15,"url":"../img/xml.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Una representación en árbol de XML","attributes":{},"skip":false,"key":"2.13.1"},{"backlink":"13-web.html#fig2.13.2","level":"2.13","list_caption":"Figure: Arquitectura orientada a Servicios","alt":"Arquitectura orientada a Servicios","nro":16,"url":"../img/api.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Arquitectura orientada a Servicios","attributes":{},"skip":false,"key":"2.13.2"},{"backlink":"14-objects.html#fig2.14.1","level":"2.14","list_caption":"Figure: Un programa","alt":"Un programa","nro":17,"url":"../img/input-output.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Un programa","attributes":{},"skip":false,"key":"2.14.1"},{"backlink":"14-objects.html#fig2.14.2","level":"2.14","list_caption":"Figure: Un programa como red de objetos","alt":"Un programa como red de objetos","nro":18,"url":"../img/program-as-network.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Un programa como red de objetos","attributes":{},"skip":false,"key":"2.14.2"},{"backlink":"14-objects.html#fig2.14.3","level":"2.14","list_caption":"Figure: Ignorar los detalles al usar un objeto","alt":"Ignorar los detalles al usar un objeto","nro":19,"url":"../img/ignoring-details.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Ignorar los detalles al usar un objeto","attributes":{},"skip":false,"key":"2.14.3"},{"backlink":"14-objects.html#fig2.14.4","level":"2.14","list_caption":"Figure: Ignorar los detalles al construir un objeto","alt":"Ignorar los detalles al construir un objeto","nro":20,"url":"../img/building-objects-details-ignored.svg","index":4,"caption_template":"Imagen - _CAPTION_","label":"Ignorar los detalles al construir un objeto","attributes":{},"skip":false,"key":"2.14.4"},{"backlink":"14-objects.html#fig2.14.5","level":"2.14","list_caption":"Figure: Una clase y dos objetos","alt":"Una clase y dos objetos","nro":21,"url":"../img/cookies.png","index":5,"caption_template":"Imagen - _CAPTION_","label":"Una clase y dos objetos","attributes":{},"skip":false,"key":"2.14.5"},{"backlink":"15-database.html#fig2.15.1","level":"2.15","list_caption":"Figure: Bases de datos relacionales","alt":"Bases de datos relacionales","nro":22,"url":"../img/databases.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Bases de datos relacionales","attributes":{},"skip":false,"key":"2.15.1"},{"backlink":"15-database.html#fig2.15.2","level":"2.15","list_caption":"Figure: A Database Cursor","alt":"A Database Cursor","nro":23,"url":"../img/database-cursor.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"A Database Cursor","attributes":{},"skip":false,"key":"2.15.2"},{"backlink":"15-database.html#fig2.15.3","level":"2.15","list_caption":"Figure: Filas en una tabla","alt":"Filas en una tabla","nro":24,"url":"../img/rows-in-table.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Filas en una tabla","attributes":{},"skip":false,"key":"2.15.3"},{"backlink":"15-database.html#fig2.15.4","level":"2.15","list_caption":"Figure: Relaciones entre tablas","alt":"Relaciones entre tablas","nro":25,"url":"img/relatinos-db.png","index":4,"caption_template":"Imagen - _CAPTION_","label":"Relaciones entre tablas","attributes":{},"skip":false,"key":"2.15.4"},{"backlink":"15-database.html#fig2.15.5","level":"2.15","list_caption":"Figure: Conectando tablas utilizando JOIN","alt":"Conectando tablas utilizando JOIN","nro":26,"url":"../img/connecting-tables.svg","index":5,"caption_template":"Imagen - _CAPTION_","label":"Conectando tablas utilizando JOIN","attributes":{},"skip":false,"key":"2.15.5"}]},"language":"es","gitbook":"*"},"file":{"path":"01-intro.md","mtime":"2020-11-03T15:12:48.368Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-03T15:13:25.577Z"},"basePath":".","book":{"language":"es"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-accordion/accordionSelector.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-githubcontributors/contributors.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-language-picker/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

