
<!DOCTYPE HTML>
<html lang="es" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>12. Programas en red · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-accordion/accordion.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-styled-blockquotes/plugin-styled-blockquotes.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-githubcontributors/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-language-picker/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="13-web.html" />
    
    
    <link rel="prev" href="11-regex.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Escribe para buscar" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introducción
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01-intro.html">
            
                <a href="01-intro.html">
            
                    
                    1. Comenzando el camino
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02-variables.html">
            
                <a href="02-variables.html">
            
                    
                    2. Variables
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="03-conditional.html">
            
                <a href="03-conditional.html">
            
                    
                    3. Condicionales
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="04-functions.html">
            
                <a href="04-functions.html">
            
                    
                    4. Funciones
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="05-iterations.html">
            
                <a href="05-iterations.html">
            
                    
                    5. Bucles
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="06-strings.html">
            
                <a href="06-strings.html">
            
                    
                    6. Cadenas
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="07-files.html">
            
                <a href="07-files.html">
            
                    
                    7. Archivos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="08-lists.html">
            
                <a href="08-lists.html">
            
                    
                    8. Listas
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="09-dictionaries.html">
            
                <a href="09-dictionaries.html">
            
                    
                    9. Diccionarios
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.10" data-path="10-tuples.html">
            
                <a href="10-tuples.html">
            
                    
                    10. Tuplas
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.11" data-path="11-regex.html">
            
                <a href="11-regex.html">
            
                    
                    11. Regex
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.12" data-path="12-network.html">
            
                <a href="12-network.html">
            
                    
                    12. Programas en red
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.13" data-path="13-web.html">
            
                <a href="13-web.html">
            
                    
                    13. Python y servicios web
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.14" data-path="14-objects.html">
            
                <a href="14-objects.html">
            
                    
                    14. Objetos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.15" data-path="15-database.html">
            
                <a href="15-database.html">
            
                    
                    15. Python y Bases de Datos
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="crditos.html">
            
                <a href="crditos.html">
            
                    
                    Créditos
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Publicado con GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >12. Programas en red</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="networked-programs">Programas en red </h1>
<ul>
<li><a href="#hypertext-transport-protocol-http">Protocolo de transporte de hipertexto - HTTP</a></li>
<li><a href="#the-worlds-simplest-web-browser">El navegador web m&#xE1;s simple del mundo</a></li>
<li><a href="#retrieving-an-image-over-http">Recuperar una imagen sobre HTTP</a></li>
<li><a href="#retrieving-web-pages-with-urllib">Recuperar p&#xE1;ginas web con <code>urllib</code></a></li>
<li><a href="#parsing-html-and-scraping-the-web">Analizando HTML y raspando la web</a></li>
<li><a href="#parsing-html-using-regular-expressions">An&#xE1;lisis HTML usando expresiones regulares</a></li>
<li><a href="#parsing-html-using-beautifulsoup">Analizando HTML usando BeautifulSoup</a></li>
<li><a href="#reading-binary-files-using-urllib">Leyendo archivos binarios usando urllib</a></li>
<li><a href="#exercises">Ejercicios</a></li>
</ul>
<p>Si bien muchos de los ejemplos de este libro se han centrado en leer archivos y buscar datos en esos archivos, hay muchas fuentes diferentes de informaci&#xF3;n cuando se considera internet.</p>
<p>En este cap&#xED;tulo simularemos ser un navegador web y recuperar p&#xE1;ginas web utilizando el Protocolo de transporte de hipertexto (HTTP). Luego leeremos los datos de la p&#xE1;gina web y los analizaremos.</p>
<h2 id="hypertext-transport-protocol-http">Protocolo de transporte de hipertexto - HTTP </h2>
<p>El protocolo de red que alimenta la web es en realidad bastante simple y hay un soporte incorporado en Python llamado <code>sockets</code> que hace que sea muy f&#xE1;cil hacer conexiones de red y recuperar datos a trav&#xE9;s de esos sockets en un programa Python.</p>
<p>Un <strong>socket</strong> es muy parecido a un archivo, excepto que un solo socket proporciona una conexi&#xF3;n bidireccional entre dos programas. Puedes leer y escribir en el mismo socket. Si escribes algo en un socket, se env&#xED;a a la aplicaci&#xF3;n en el otro extremo del socket. Si lees desde el socket, se te proporcionan los datos que la otra aplicaci&#xF3;n ha enviado.</p>
<p>Pero si intentas leer un socket cuando el programa en el otro extremo del socket no ha enviado ning&#xFA;n dato, simplemente si&#xE9;ntate y espera. Si los programas en ambos extremos del socket simplemente esperan algunos datos sin enviar nada, esperar&#xE1;n por mucho tiempo.</p>
<p>Una parte importante de los programas que se comunican a trav&#xE9;s de Internet es tener alg&#xFA;n tipo de protocolo. Un protocolo es un conjunto de reglas precisas que determinan qui&#xE9;n debe ir primero, qu&#xE9; deben hacer, y luego cu&#xE1;les son las respuestas a ese mensaje, y qui&#xE9;n env&#xED;a el siguiente, y as&#xED; sucesivamente. En cierto sentido, las dos aplicaciones en cada extremo del socket est&#xE1;n bailando y asegur&#xE1;ndose de no pisarse los dedos de los pies.</p>
<p>Hay muchos documentos que describen estos protocolos de red. El protocolo de transporte de hipertexto se describe en el siguiente documento:</p>
<p><a href="http://www.w3.org/Protocols/rfc2616/rfc2616.txt" target="_blank">http://www.w3.org/Protocols/rfc2616/rfc2616.txt</a></p>
<p>Este es un documento largo y complejo de 176 p&#xE1;ginas con muchos detalles. Si lo encuentras interesante, si&#xE9;ntete libre de leerlo todo. Pero si echas un vistazo a la p&#xE1;gina 36 de RFC2616 encontrar&#xE1;s la sintaxis de la solicitud GET. Para solicitar un documento de un servidor web, hacemos una conexi&#xF3;n al servidor <code>www.pr4e.org</code> en el puerto 80 y luego enviamos una l&#xED;nea del formulario</p>
<p><code>GET http://data.pr4e.org/romeo.txt HTTP/1.0</code></p>
<p>donde el segundo par&#xE1;metro es la p&#xE1;gina web que solicitamos, y luego tambi&#xE9;n enviamos una l&#xED;nea en blanco. El servidor web responder&#xE1; con cierta informaci&#xF3;n de encabezado sobre el documento y una l&#xED;nea en blanco seguida del contenido del documento.</p>
<h2 id="the-worlds-simplest-web-browser">El navegador web m&#xE1;s simple del mundo </h2>
<p>Quiz&#xE1;s la forma m&#xE1;s f&#xE1;cil de mostrar c&#xF3;mo funciona el protocolo HTTP es escribir un programa Python muy simple que haga una conexi&#xF3;n a un servidor web y siga las reglas del protocolo HTTP para solicitar un documento y mostrar lo que el servidor env&#xED;a.</p>
<iframe src="https://trinket.io/embed/python3/734cda1053" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>Primero, el programa realiza una conexi&#xF3;n al puerto 80 en el servidor [www.py4e.com] (<a href="http://www.py4e.com" target="_blank">http://www.py4e.com</a>). Dado que nuestro programa desempe&#xF1;a el papel de &quot;navegador web&quot;, el protocolo HTTP dice que debemos enviar el comando GET seguido de una l&#xED;nea en blanco.</p>
<figure id="fig2.12.1"><img src="../img/socket.svg" alt="A Socket Connection"><figcaption>Imagen - A Socket Connection</figcaption></figure>
<p>Una vez que enviamos esa l&#xED;nea en blanco, escribimos un bucle que recibe datos en fragmentos de 512 caracteres del socket e imprime los datos hasta que no haya m&#xE1;s datos para leer (es decir, recv() devuelve una cadena vac&#xED;a).</p>
<p>El programa produce la siguiente salida:</p>
<pre><code class="lang-txt">HTTP/1.1 200 OK
Date: Sun, 14 Mar 2010 23:52:41 GMT
Server: Apache
Last-Modified: Tue, 29 Dec 2009 01:31:22 GMT
ETag: &quot;143c1b33-a7-4b395bea&quot;
Accept-Ranges: bytes
Content-Length: 167
Connection: close
Content-Type: text/plain

But soft what light through yonder window breaks
It is the east and Juliet is the sun
Arise fair sun and kill the envious moon
Who is already sick and pale with grief
</code></pre>
<p>La salida comienza con los encabezados que el servidor web env&#xED;a para describir el documento. Por ejemplo, el encabezado <code>Content-Type</code> indica que el documento es un documento de texto sin formato (<code>text/plain</code>).</p>
<p>Una vez que el servidor nos env&#xED;a los encabezados, agrega una l&#xED;nea en blanco para indicar el final de los encabezados y luego env&#xED;a los datos reales del archivo <code>romeo.txt</code>.</p>
<p>Este ejemplo muestra c&#xF3;mo realizar una conexi&#xF3;n de red de bajo nivel con sockets. Los sockets se pueden utilizar para comunicarse con un servidor web o con un servidor de correo o con muchos otros tipos de servidores. Todo lo que se necesita es encontrar el documento que describe el protocolo y escribir el c&#xF3;digo para enviar y recibir los datos de acuerdo con el protocolo.</p>
<p>Sin embargo, dado que el protocolo que usamos con mayor frecuencia es el protocolo web HTTP, Python tiene una biblioteca especial dise&#xF1;ada espec&#xED;ficamente para admitir el protocolo HTTP para la recuperaci&#xF3;n de documentos y datos a trav&#xE9;s de la web.</p>
<h2 id="retrieving-an-image-over-http">Recuperar una imagen sobre HTTP </h2>
<p>En el ejemplo anterior, recuperamos un archivo de texto sin formato que ten&#xED;a nuevas l&#xED;neas en el archivo y simplemente copiamos los datos a la pantalla mientras se ejecutaba el programa. Podemos usar un programa similar para recuperar una imagen usando HTTP. En lugar de copiar los datos en la pantalla a medida que se ejecuta el programa, acumulamos los datos en una cadena, recortamos los encabezados y luego guardamos los datos de la imagen en un archivo de la siguiente manera:</p>
<iframe src="https://trinket.io/embed/python3/ba6a2ee376" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>Cuando el programa se ejecuta produce el siguiente resultado:</p>
<pre><code class="lang-bash">$ python urljpeg.py
2920 2920
1460 4380
1460 5840
1460 7300
...
1460 62780
1460 64240
2920 67160
1460 68620
1681 70301
Header length 240
HTTP/1.1 200 OK
Date: Sat, 02 Nov 2013 02:15:07 GMT
Server: Apache
Last-Modified: Sat, 02 Nov 2013 02:01:26 GMT
ETag: <span class="hljs-string">&quot;19c141-111a9-4ea280f8354b8&quot;</span>
Accept-Ranges: bytes
Content-Length: 70057
Connection: close
Content-Type: image/jpeg
</code></pre>
<p>Puedes ver que para esta URL, el encabezado <code>Content-Type</code> indica que el cuerpo del documento es una imagen (<code>image/jpeg</code>). Una vez que el programa se completa, puedes ver los datos de la imagen abriendo el archivo <code>stuff.jpg</code> en un visor de im&#xE1;genes.</p>
<p>A medida que se ejecuta el programa, puedes ver que no obtenemos 5120 caracteres cada vez que llamamos al m&#xE9;todo <code>recv()</code>. Recibimos tantos caracteres como nos ha sido transferido a trav&#xE9;s de la red por el servidor web en el momento que llamamos <code>recv()</code>. En este ejemplo, obtenemos 1460 o 2920 caracteres cada vez que solicitamos hasta 5120 caracteres de datos.</p>
<p>Sus resultados pueden ser diferentes dependiendo de la velocidad de su red. Tambi&#xE9;n ten en cuenta que en la &#xFA;ltima llamada a <code>recv()</code> obtenemos 1681 bytes, que es el final de la secuencia, y en la siguiente llamada a <code>recv()</code> obtenemos una cadena de longitud cero que nos dice que el servidor ha llamado a <code>close()</code> en su extremo del socket y no hay m&#xE1;s datos por venir.</p>
<p>Podemos ralentizar nuestras llamadas sucesivas <code>recv()</code> sin comentar la llamada a <code>time.sleep()</code>. De esta manera, esperamos un cuarto de segundo despu&#xE9;s de cada llamada para que el servidor pueda &quot;adelantarse&quot; y enviarnos m&#xE1;s datos antes de que llamemos a <code>recv()</code> nuevamente. Con el retraso, en su lugar el programa se ejecuta de la siguiente manera:</p>
<pre><code class="lang-txt">$ python urljpeg.py
1460 1460
5120 6580
5120 11700
...
5120 62900
5120 68020
2281 70301
Header length 240
HTTP/1.1 200 OK
Date: Sat, 02 Nov 2013 02:22:04 GMT
Server: Apache
Last-Modified: Sat, 02 Nov 2013 02:01:26 GMT
ETag: &quot;19c141-111a9-4ea280f8354b8&quot;
Accept-Ranges: bytes
Content-Length: 70057
Connection: close
Content-Type: image/jpeg
</code></pre>
<p>Ahora, aparte de las primeras y &#xFA;ltimas llamadas a <code>recv()</code>, ahora obtenemos 5120 caracteres cada vez que pedimos nuevos datos.</p>
<p>Hay un b&#xFA;fer entre el servidor que realiza las solicitudes <code>send()</code> y nuestra aplicaci&#xF3;n que realiza las solicitudes <code>recv()</code>. Cuando ejecutamos el programa con tiempos de espera, en alg&#xFA;n momento el servidor podr&#xED;a llenar el b&#xFA;fer en el socket y ser forzado a pausar hasta que nuestro programa comience a vaciar el b&#xFA;fer. La pausa de la aplicaci&#xF3;n de env&#xED;o o la aplicaci&#xF3;n de recepci&#xF3;n se denomina &quot;control de flujo&quot;.</p>
<h2 id="retrieving-web-pages-with-urllib">Recuperar p&#xE1;ginas web con <code>urllib</code> </h2>
<p>Si bien podemos enviar y recibir datos manualmente a trav&#xE9;s de HTTP utilizando la biblioteca de sockets, hay una forma mucho m&#xE1;s sencilla de realizar esta tarea com&#xFA;n en Python utilizando la biblioteca <code>urllib</code>.</p>
<p>Usando <code>urllib</code>, puedes tratar una p&#xE1;gina web como un archivo. Simplemente indique qu&#xE9; p&#xE1;gina web deseas recuperar y <code>urllib</code> se encarga de todos los detalles del protocolo HTTP y del encabezado.</p>
<p>El c&#xF3;digo equivalente para leer el archivo <code>romeo.txt</code> de la web usando<code>urllib</code> es el siguiente:</p>
<iframe src="https://trinket.io/embed/python3/8ead88f3fa" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>Una vez que la p&#xE1;gina web se ha abierto con <code>urllib.urlopen</code>, podemos tratarla como un archivo y leerla utilizando un bucle <code>for</code>.</p>
<p>Cuando el programa se ejecuta, solo vemos la salida del contenido del archivo. Los encabezados a&#xFA;n se env&#xED;an, pero el c&#xF3;digo <code>urllib</code> consume los encabezados y solo nos devuelve los datos.</p>
<pre><code class="lang-txt">But soft what light through yonder window breaks
It is the east and Juliet is the sun
Arise fair sun and kill the envious moon
Who is already sick and pale with grief
</code></pre>
<p>Como ejemplo, podemos escribir un programa para recuperar los datos para <code>romeo.txt</code> y calcular la frecuencia de cada palabra en el archivo de la siguiente manera:</p>
<iframe src="https://trinket.io/embed/python3/6669c56892" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>Nuevamente, una vez que hemos abierto la p&#xE1;gina web, podemos leerla como un archivo local.</p>
<h2 id="parsing-html-and-scraping-the-web">Analizando HTML y raspando la web </h2>
<p>Uno de los usos comunes de la capacidad <code>urllib</code> en Python es <strong>raspar</strong> la web. El raspado web (web scraping) tiene lugar cuando escribimos un programa que pretende ser un navegador web y recupera p&#xE1;ginas, luego examina los datos en esas p&#xE1;ginas en busca de patrones.</p>
<p>Como ejemplo, un motor de b&#xFA;squeda como Google buscar&#xE1; en el origen de una p&#xE1;gina web y extraer&#xE1; los enlaces a otras p&#xE1;ginas y recuperar&#xE1; esas p&#xE1;ginas, extrayendo enlaces, etc. Usando esta t&#xE9;cnica, Google Spider se abre paso a trav&#xE9;s de casi todas las p&#xE1;ginas de la web.</p>
<p>Google tambi&#xE9;n utiliza la frecuencia de los enlaces de las p&#xE1;ginas que encuentra a una p&#xE1;gina en particular como una medida de cu&#xE1;n &quot;importante&quot; es una p&#xE1;gina y qu&#xE9; tan alta debe aparecer la p&#xE1;gina en los resultados de b&#xFA;squeda.</p>
<h2 id="parsing-html-using-regular-expressions">An&#xE1;lisis HTML usando expresiones regulares </h2>
<p>Una forma sencilla de analizar HTML es usar expresiones regulares para buscar y extraer subcadenas que coincidan con un patr&#xF3;n en particular.</p>
<p>Aqu&#xED; hay una simple p&#xE1;gina web:</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">h1</span>&gt;</span>The First Page<span class="hljs-tag">&lt;/<span class="hljs-name">h1</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>
If you like, you can switch to the
<span class="hljs-tag">&lt;<span class="hljs-name">a</span> <span class="hljs-attr">href</span>=<span class="hljs-string">&quot;http://www.dr-chuck.com/page2.htm&quot;</span>&gt;</span>
Second Page<span class="hljs-tag">&lt;/<span class="hljs-name">a</span>&gt;</span>.
<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
</code></pre>
<p>Podemos construir una expresi&#xF3;n regular bien formada para que coincida y extraiga los valores de enlace del texto anterior de la siguiente manera:</p>
<pre><code class="lang-python">href=<span class="hljs-string">&quot;http://.+?&quot;</span>
</code></pre>
<p>Nuestra expresi&#xF3;n regular busca cadenas que comiencen con <code>href=&quot;http://</code>, seguidas de uno o m&#xE1;s caracteres (&quot;.+?&quot;), seguidas de otra comilla doble. El signo de interrogaci&#xF3;n &quot;.+? &quot; indica que la coincidencia debe realizarse de manera &quot;no codiciosa&quot; en lugar de &quot;codiciosa&quot;. Una coincidencia no codiciosa trata de encontrar la cadena de coincidencia <strong>m&#xE1;s peque&#xF1;a</strong> posible y una coincidencia codiciosa trata de encontrar la <strong>m&#xE1;s grande</strong> posible cadena coincidente.</p>
<p>Agregamos par&#xE9;ntesis a nuestra expresi&#xF3;n regular para indicar qu&#xE9; parte de nuestra cadena coincidente nos gustar&#xED;a extraer y producir el siguiente programa:</p>
<iframe src="https://trinket.io/embed/python3/436b82b9ea" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>El m&#xE9;todo de expresi&#xF3;n regular <code>findall</code> nos dar&#xE1; una lista de todas las cadenas que coinciden con nuestra expresi&#xF3;n regular, devolviendo solo el texto del enlace entre las comillas dobles.</p>
<p>Cuando ejecutamos el programa, obtenemos el siguiente resultado:</p>
<pre><code class="lang-python">python urlregex.py
Enter - http://www.dr-chuck.com/page1.htm
http://www.dr-chuck.com/page2.htm
</code></pre>
<pre><code class="lang-python">python urlregex.py
Enter - http://www.py4e.com/book.htm
http://www.greenteapress.com/thinkpython/thinkpython.html
http://allendowney.com/
http://www.py4e.com/code
http://www.lib.umich.edu/espresso-book-machine
http://www.py4e.com/py4inf-slides.zip
</code></pre>
<p>Las expresiones regulares funcionan muy bien cuando tu HTML est&#xE1; bien formateado y es predecible. Pero como hay muchas p&#xE1;ginas HTML &quot;rotas&quot; por ah&#xED;, una soluci&#xF3;n que solo use expresiones regulares podr&#xED;a perder algunos enlaces v&#xE1;lidos o terminar con datos err&#xF3;neos.</p>
<p>Esto se puede resolver utilizando una biblioteca de an&#xE1;lisis HTML robusta.</p>
<h2 id="parsing-html-using-beautifulsoup">Analizando HTML usando BeautifulSoup </h2>
<p>Hay una serie de bibliotecas de Python que pueden ayudarte a analizar HTML y extraer datos de las p&#xE1;ginas. Cada una de las bibliotecas tiene sus fortalezas y debilidades y puedes elegir una seg&#xFA;n tus necesidades.</p>
<p>Como ejemplo, simplemente analizaremos algunas entradas de HTML y extraeremos enlaces utilizando la biblioteca <strong>BeautifulSoup</strong>. Puedes descargar e instalar el c&#xF3;digo de <a href="https://www.crummy.com/software/BeautifulSoup/" target="_blank">BeautifulSoup</a> abriendo una terminal y escribiendo <code>pip install bs4</code></p>
<p>A pesar de que el HTML se parece a XML <sup><a href="#fn_1" id="reffn_1">1</a></sup> y algunas p&#xE1;ginas se construyen cuidadosamente para ser XML, la mayor&#xED;a de HTML generalmente se rompe de manera que un analizador XML rechaza la p&#xE1;gina completa de HTML como incorrectamente formado. BeautifulSoup tolera HTML muy defectuoso y a&#xFA;n le permite extraer f&#xE1;cilmente los datos que necesita.</p>
<p>Usaremos <code>urllib</code> para leer la p&#xE1;gina y luego usaremos <code>BeautifulSoup</code> para extraer los atributos <code>href</code> de las etiquetas de anclaje (<code>a</code>).</p>
<iframe src="https://trinket.io/embed/python3/d64a07806f" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>El programa solicita una direcci&#xF3;n web, luego abre la p&#xE1;gina web, lee los datos y pasa los datos al analizador BeautifulSoup, y luego recupera todas las etiquetas de anclaje e imprime el atributo <code>href</code> para cada etiqueta.</p>
<p>Cuando el programa se ejecuta se ve como sigue:</p>
<pre><code class="lang-python">python urllinks.py
Enter - http://www.dr-chuck.com/page1.htm
http://www.dr-chuck.com/page2.htm
</code></pre>
<pre><code class="lang-python">python urllinks.py
Enter - http://www.py4e.com/book.htm
http://www.greenteapress.com/thinkpython/thinkpython.html
http://allendowney.com/
http://www.si502.com/
http://www.lib.umich.edu/espresso-book-machine
http://www.py4e.com/code
http://www.py4e.com/
</code></pre>
<p>Puedes usar BeautifulSoup para extraer varias partes de cada etiqueta de la siguiente manera:</p>
<iframe src="https://trinket.io/embed/python3/0d6e91e4d7" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<pre><code class="lang-python">python urllink2.py
Enter - http://www.dr-chuck.com/page1.htm
TAG: &lt;a href=&quot;http://www.dr-chuck.com/page2.htm&quot;&gt;
Second Page&lt;/a&gt;
URL: http://www.dr-chuck.com/page2.htm
Content: [&apos;\nSecond Page&apos;]
Attrs: [(&apos;href&apos;, &apos;http://www.dr-chuck.com/page2.htm&apos;)]
</code></pre>
<p>Estos ejemplos solo comienzan a mostrar el poder de BeautifulSoup cuando se trata de analizar HTML.</p>
<h2 id="reading-binary-files-using-urllib">Leyendo archivos binarios usando urllib </h2>
<p>A veces deseas recuperar un archivo que no sea de texto (o binario), como un archivo de imagen o video. Los datos en estos archivos generalmente no son &#xFA;tiles para imprimir, pero puedes hacer f&#xE1;cilmente una copia de una URL a un archivo local en tu disco duro usando <code>urllib</code>.</p>
<p>El patr&#xF3;n es abrir la URL y usar <code>read</code> para descargar todo el contenido del documento en una variable de cadena (<code>img</code>) y luego escribir esa informaci&#xF3;n en un archivo local de la siguiente manera:</p>
<iframe src="https://trinket.io/embed/python3/5594c1233b" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>Este programa lee todos los datos de una sola vez a trav&#xE9;s de la red y los almacena en la variable <code>img</code> en la memoria principal de tu ordenador, luego abre el archivo <code>cover.jpg</code> y escribe los datos en tu disco. Esto funcionar&#xE1; si el tama&#xF1;o del archivo es menor que el tama&#xF1;o de la memoria de tu ordenador.</p>
<p>Sin embargo, si se trata de un gran archivo de audio o video, este programa puede fallar o, al menos, ejecutarse muy lentamente cuando el ordenador se queda sin memoria. Para evitar quedarse sin memoria, recuperamos los datos en bloques (o b&#xFA;feres) y luego escribimos cada bloque en tu disco antes de recuperar el siguiente bloque. De esta manera, el programa puede leer archivos de cualquier tama&#xF1;o sin utilizar toda la memoria que tienes en tu ordenador.</p>
<iframe src="https://trinket.io/embed/python3/a78adf3c8a" width="100%" height="356" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>

<p>En este ejemplo, leemos solo 100,000 caracteres a la vez y luego escribimos esos caracteres en el archivo <code>cover.jpg</code> antes de recuperar los siguientes 100,000 caracteres de datos de la web.</p>
<p>Este programa se ejecuta de la siguiente manera:</p>
<pre><code class="lang-python">python curl2.py
<span class="hljs-number">568248</span> characters copied.
</code></pre>
<p>Si tienes un ordenador Unix o Macintosh, es probable que tengas un comando integrado en tu sistema operativo que realice esta operaci&#xF3;n de la siguiente manera:</p>
<pre><code class="lang-python">curl -O http://www.py4e.com/cover.jpg
</code></pre>
<p>El comando <code>curl</code> es la abreviatura de &quot;copy URL&quot;, por lo que estos dos ejemplos se denominan <code>curl1.py</code> y <code>curl2.py</code> en <a href="http://www.py4e.com/code3" target="_blank">www.py4e.com/code3</a> ya que implementan una funcionalidad similar a la del comando <code>curl</code>. Tambi&#xE9;n hay un programa de ejemplo <code>curl3.py</code> que realiza esta tarea con un poco m&#xE1;s de eficacia, en caso de que realmente desees utilizar este patr&#xF3;n en un programa que est&#xE9;s escribiendo.</p>
<h2 id="exercises">Ejercicios </h2>
<p><strong>Ejercicio 1:</strong> Cambia el programa de socket <code>socket1.py</code> para solicitar al usuario la URL para que pueda leer cualquier p&#xE1;gina web. Puede usar <code>split(&apos;/&apos;)</code> para dividir la URL en sus componentes, de modo que puedas extraer el nombre de host para la llamada socket <code>connect</code>. Agrega la comprobaci&#xF3;n de errores utilizando <code>try</code> y <code>except</code> para manejar la condici&#xF3;n en la que el usuario ingresa una URL con formato incorrecto o inexistente.</p>
<p><strong>Ejercicio 2:</strong> Cambia tu programa de socket para que cuente la cantidad de caracteres que ha recibido y deje de mostrar cualquier texto despu&#xE9;s de haber mostrado 3000 caracteres. El programa debe recuperar todo el documento, contar el n&#xFA;mero total de caracteres y mostrar el recuento del n&#xFA;mero de caracteres al final del documento.</p>
<p><strong>Ejercicio 3:</strong> Usa <code>urllib</code> para replicar el ejercicio anterior de (1) recuperar el documento de una URL, (2) mostrar hasta 3000 caracteres, y (3) contar el n&#xFA;mero total de caracteres en el documento. No te preocups por los encabezados de este ejercicio, simplemente muestra los primeros 3000 caracteres del contenido del documento.</p>
<p><strong>Ejercicio 4:</strong> Cambia el programa <code>urllinks.py</code> para extraer y contar las etiquetas de p&#xE1;rrafo (p) del documento HTML recuperado y mostrar el recuento de los p&#xE1;rrafos como salida de tu programa. No mostrar el texto del p&#xE1;rrafo, solo contarlos. Prueba tu programa en varias p&#xE1;ginas web peque&#xF1;as, as&#xED; como en algunas p&#xE1;ginas web m&#xE1;s grandes.</p>
<p><strong>Ejercicio 5:</strong> (Avanzado) Cambia el programa de socket para que solo muestre datos despu&#xE9;s de que se hayan recibido los encabezados y una l&#xED;nea en blanco. Recuerda que <code>recv</code> est&#xE1; recibiendo caracteres (nuevas l&#xED;neas y dem&#xE1;s), no l&#xED;neas.</p>
<hr>
<blockquote id="fn_1">
<sup>1</sup>. El formato XML se describe en el siguiente cap&#xED;tulo.<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>
<p><div id="page-footer" class="localized-footer"><hr><p><a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank"><img alt="Licencia de Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by-nc-sa/4.0/80x15.png"></a><br><span xmlns:dct="http://purl.org/dc/terms/" property="dct:title">Python for person in everybody</span>, escrito a partir del libro <a rel="license" href="https://www.py4e.com/book" target="_blank">&apos;Python for Everybody&apos;</a> por <span xmlns:cc="http://creativecommons.org/ns#" property="cc:attributionName"><a rel="license" href="http://www.dr-chuck.com/" target="_blank">Charles R. Severance</a></span> bajo licencia <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">Creative Commons Reconocimiento-NoComercial-CompartirIgual 4.0 Internacional License</a>.</p>
</div></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="11-regex.html" class="navigation navigation-prev " aria-label="Previous page: 11. Regex">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="13-web.html" class="navigation navigation-next " aria-label="Next page: 13. Python y servicios web">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"12. Programas en red","level":"2.12","depth":1,"next":{"title":"13. Python y servicios web","level":"2.13","depth":1,"path":"13-web.md","ref":"13-web.md","articles":[]},"previous":{"title":"11. Regex","level":"2.11","depth":1,"path":"11-regex.md","ref":"11-regex.md","articles":[]},"dir":"ltr"},"config":{"plugins":["youtube","image-captions","accordion","styled-blockquotes","localized-footer","edit-link","githubcontributors","language-picker","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"language-picker":{"grid-columns":3},"youtube":{},"accordion":{},"search":{},"styled-blockquotes":{},"localized-footer":{"filename":"./FOOTER.md","hline":true},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"ga":{"configuration":"auto","token":"UA-135691041-2"},"githubcontributors":{"contributorWidth":"300px","githubOwner":"catedu","githubRepository":"python-for-person-in-everybody"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":{"en":"Edit this page","es":"Edita esta página"},"base":"https://github.com/catedu/python-for-person-in-everybody/edit/master/"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"image-captions":{"caption":"Imagen - _CAPTION_","variable_name":"_pictures"}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"title":"Python for person in everybody","author":"Charles R. Severance","collaborators":[{"name":"_________","edited":"_____________"}],"_pictures":[{"backlink":"01-intro.html#fig2.1.1","level":"2.1","list_caption":"Figure: Instalando Python","alt":"Instalando Python","nro":1,"url":"https://deleyva.gitbooks.io/automatiza-tu-aprendizaje-con-python/content/img/python-path.png","index":1,"caption_template":"Imagen - _CAPTION_","label":"Instalando Python","attributes":{},"skip":false,"key":"2.1.1"},{"backlink":"01-intro.html#fig2.1.2","level":"2.1","list_caption":"Figure: Asistente personal digital","alt":"Asistente personal digital","nro":2,"url":"../img/descarga.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Asistente personal digital","attributes":{},"skip":false,"key":"2.1.2"},{"backlink":"01-intro.html#fig2.1.3","level":"2.1","list_caption":"Figure: Programadores hablando contigo","alt":"Programadores hablando contigo","nro":3,"url":"../img/programers-talking-to-you.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Programadores hablando contigo","attributes":{},"skip":false,"key":"2.1.3"},{"backlink":"01-intro.html#fig2.1.4","level":"2.1","list_caption":"Figure: Arquitectura de hardware","alt":"Arquitectura de hardware","nro":4,"url":"../img/hardware-architecture.svg","index":4,"caption_template":"Imagen - _CAPTION_","label":"Arquitectura de hardware","attributes":{},"skip":false,"key":"2.1.4"},{"backlink":"01-intro.html#fig2.1.5","level":"2.1","list_caption":"Figure: ¿Dónde estás?","alt":"¿Dónde estás?","nro":5,"url":"../img/where-r-you.svg","index":5,"caption_template":"Imagen - _CAPTION_","label":"¿Dónde estás?","attributes":{},"skip":false,"key":"2.1.5"},{"backlink":"03-conditional.html#fig2.3.1","level":"2.3","list_caption":"Figure: Si logica","alt":"Si logica","nro":6,"url":"../img/if.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Si logica","attributes":{},"skip":false,"key":"2.3.1"},{"backlink":"03-conditional.html#fig2.3.2","level":"2.3","list_caption":"Figure: Lógica de If-Then-Else","alt":"Lógica de If-Then-Else","nro":7,"url":"../img/if-else.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Lógica de If-Then-Else","attributes":{},"skip":false,"key":"2.3.2"},{"backlink":"03-conditional.html#fig2.3.3","level":"2.3","list_caption":"Figure: Lógica de elif","alt":"Lógica de elif","nro":8,"url":"../img/elif.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Lógica de elif","attributes":{},"skip":false,"key":"2.3.3"},{"backlink":"03-conditional.html#fig2.3.4","level":"2.3","list_caption":"Figure: Nested If Statements","alt":"Nested If Statements","nro":9,"url":"../img/nested.svg","index":4,"caption_template":"Imagen - _CAPTION_","label":"Nested If Statements","attributes":{},"skip":false,"key":"2.3.4"},{"backlink":"06-strings.html#fig2.6.1","level":"2.6","list_caption":"Figure: String Indexes","alt":"String Indexes","nro":10,"url":"../img/banana.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"String Indexes","attributes":{},"skip":false,"key":"2.6.1"},{"backlink":"07-files.html#fig2.7.1","level":"2.7","list_caption":"Figure: Memoria secundaria","alt":"Memoria secundaria","nro":11,"url":"../img/seconday_memory.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Memoria secundaria","attributes":{},"skip":false,"key":"2.7.1"},{"backlink":"07-files.html#fig2.7.2","level":"2.7","list_caption":"Figure: A File Handle","alt":"A File Handle","nro":12,"url":"../img/file-handle.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"A File Handle","attributes":{},"skip":false,"key":"2.7.2"},{"backlink":"08-lists.html#fig2.8.1","level":"2.8","list_caption":"Figure: Variables y objetos","alt":"Variables y objetos","nro":13,"url":"../img/variables-objects.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Variables y objetos","attributes":{},"skip":false,"key":"2.8.1"},{"backlink":"12-network.html#fig2.12.1","level":"2.12","list_caption":"Figure: A Socket Connection","alt":"A Socket Connection","nro":14,"url":"../img/socket.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"A Socket Connection","attributes":{},"skip":false,"key":"2.12.1"},{"backlink":"13-web.html#fig2.13.1","level":"2.13","list_caption":"Figure: Una representación en árbol de XML","alt":"Una representación en árbol de XML","nro":15,"url":"../img/xml.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Una representación en árbol de XML","attributes":{},"skip":false,"key":"2.13.1"},{"backlink":"13-web.html#fig2.13.2","level":"2.13","list_caption":"Figure: Arquitectura orientada a Servicios","alt":"Arquitectura orientada a Servicios","nro":16,"url":"../img/api.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Arquitectura orientada a Servicios","attributes":{},"skip":false,"key":"2.13.2"},{"backlink":"14-objects.html#fig2.14.1","level":"2.14","list_caption":"Figure: Un programa","alt":"Un programa","nro":17,"url":"../img/input-output.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Un programa","attributes":{},"skip":false,"key":"2.14.1"},{"backlink":"14-objects.html#fig2.14.2","level":"2.14","list_caption":"Figure: Un programa como red de objetos","alt":"Un programa como red de objetos","nro":18,"url":"../img/program-as-network.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"Un programa como red de objetos","attributes":{},"skip":false,"key":"2.14.2"},{"backlink":"14-objects.html#fig2.14.3","level":"2.14","list_caption":"Figure: Ignorar los detalles al usar un objeto","alt":"Ignorar los detalles al usar un objeto","nro":19,"url":"../img/ignoring-details.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Ignorar los detalles al usar un objeto","attributes":{},"skip":false,"key":"2.14.3"},{"backlink":"14-objects.html#fig2.14.4","level":"2.14","list_caption":"Figure: Ignorar los detalles al construir un objeto","alt":"Ignorar los detalles al construir un objeto","nro":20,"url":"../img/building-objects-details-ignored.svg","index":4,"caption_template":"Imagen - _CAPTION_","label":"Ignorar los detalles al construir un objeto","attributes":{},"skip":false,"key":"2.14.4"},{"backlink":"14-objects.html#fig2.14.5","level":"2.14","list_caption":"Figure: Una clase y dos objetos","alt":"Una clase y dos objetos","nro":21,"url":"../img/cookies.png","index":5,"caption_template":"Imagen - _CAPTION_","label":"Una clase y dos objetos","attributes":{},"skip":false,"key":"2.14.5"},{"backlink":"15-database.html#fig2.15.1","level":"2.15","list_caption":"Figure: Bases de datos relacionales","alt":"Bases de datos relacionales","nro":22,"url":"../img/databases.svg","index":1,"caption_template":"Imagen - _CAPTION_","label":"Bases de datos relacionales","attributes":{},"skip":false,"key":"2.15.1"},{"backlink":"15-database.html#fig2.15.2","level":"2.15","list_caption":"Figure: A Database Cursor","alt":"A Database Cursor","nro":23,"url":"../img/database-cursor.svg","index":2,"caption_template":"Imagen - _CAPTION_","label":"A Database Cursor","attributes":{},"skip":false,"key":"2.15.2"},{"backlink":"15-database.html#fig2.15.3","level":"2.15","list_caption":"Figure: Filas en una tabla","alt":"Filas en una tabla","nro":24,"url":"../img/rows-in-table.svg","index":3,"caption_template":"Imagen - _CAPTION_","label":"Filas en una tabla","attributes":{},"skip":false,"key":"2.15.3"},{"backlink":"15-database.html#fig2.15.4","level":"2.15","list_caption":"Figure: Relaciones entre tablas","alt":"Relaciones entre tablas","nro":25,"url":"img/relatinos-db.png","index":4,"caption_template":"Imagen - _CAPTION_","label":"Relaciones entre tablas","attributes":{},"skip":false,"key":"2.15.4"},{"backlink":"15-database.html#fig2.15.5","level":"2.15","list_caption":"Figure: Conectando tablas utilizando JOIN","alt":"Conectando tablas utilizando JOIN","nro":26,"url":"../img/connecting-tables.svg","index":5,"caption_template":"Imagen - _CAPTION_","label":"Conectando tablas utilizando JOIN","attributes":{},"skip":false,"key":"2.15.5"}]},"language":"es","gitbook":"*"},"file":{"path":"12-network.md","mtime":"2020-11-03T15:12:48.372Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-03T15:13:25.577Z"},"basePath":".","book":{"language":"es"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-accordion/accordionSelector.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-githubcontributors/contributors.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-language-picker/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

